const info = {
    "少典": {
      intro: "妻附宝。也称有熊氏,《国语》载其嫡子为炎帝神农氏和黄帝轩辕氏。",
    },
    "黄帝": {
      intro: "五帝之首, 人文初祖。据说他是少典与附宝之子,本姓公孙,后改姬姓,也有说巳姓。名轩辕,一说名轩。建都于有熊,亦称有熊氏。也有人称之为“帝鸿氏”",
    },  
    "帝喾": {
      intro: "十五岁时,因辅佐颛顼帝有功,被封于高辛(今安徽亳州)。三十岁时,代颛顼为帝,都于亳。因他兴起于高辛,史称之为高辛氏",
    },
    "颛顼帝": {
      intro: "高阳",
    },
    "禹": {
      intro: "姒姓,夏后氏,传说名文命,后世尊称为大禹。",
    },
    "中康": {
      intro: "太康弟",
    },
    "帝杼": {
      intro: "名字另作予、宁、佇、宇、相曼、舆或作季杼。在位17年。",
    },
    "冥": {
      intro: "前?年-前1875年在位",
    },
    "王亥": {
      intro: "又名振,前1875年-前1775年在位",
    },
    "上甲微": {
      intro: "前1770年-前1720年在位",
    },
    "主癸": {
      intro: "前?年-前1675年在位",
    },
    "成汤": {
      intro: "天乙,子履. 子姓.商朝开国君主,在位30年",
    },
};

  export default info;