const data = {
  周: {
    鲁: [
      //   {
      //     name: "周公旦",
      //     info: "鲁国是周朝诸侯国之一，姬姓，侯爵，公元前1043年，由周公旦所建立，到公元前256年被楚国所灭，历时787年，前后相传25世，共计36位君主，鲁国最初封土只有百里左右，到后来最强盛的时期，一度与齐国争夺东方的霸主",
      //   },
      {
        name: "鲁公",
        start: -1043,
        end: -998,
        info: "姬伯禽. 奄国覆灭后，姬伯禽的父亲周公旦，受封于奄国故土，建立鲁国，定都曲阜，而周公旦不去赴任，要留下来辅佐周天子，就让姬伯禽去即位，姬伯禽在位期间，平定徐戎叛乱，坚持以周礼治国，使鲁国政治经济出现新局面，成为周王朝控制东方的一个重要邦国",
      },
      {
        name: "鲁考公",
        start: -998,
        end: -994,
        info: "姬酋，鲁公姬子，姬酋在位期间，勤政爱民，体恤当地的老百姓，深受当地人民的爱戴",
      },
      {
        name: "鲁炀公",
        start: -994,
        end: -988,
        info: "姬熙，鲁公姬子，鲁考公弟",
      },
      {
        name: "鲁幽公",
        start: -988,
        end: -974,
        info: "姬宰，鲁炀公子，被其弟所杀",
      },
      {
        name: "鲁魏公",
        start: -974,
        end: -924,
        info: "姬晞，鲁炀公子，鲁幽公弟，杀兄自立为君",
      },
      {
        name: "鲁厉公",
        start: -924,
        end: -887,
        info: "姬擢，鲁魏公子",
      },
      {
        name: "鲁献公",
        start: -887,
        end: -855,
        info: "姬具，鲁魏公子，鲁厉公弟",
      },
      {
        name: "鲁真公",
        start: -855,
        end: -825,
        info: "姬濞，鲁献公子",
      },
      {
        name: "鲁武公",
        start: -825,
        end: -816,
        info: "姬敖，鲁献公子，鲁真公弟，曾和大小儿子一起去朝见周宣王，周宣王将其小儿子姬戏立为太子",
      },
      {
        name: "鲁懿公",
        start: -816,
        end: -807,
        info: "姬戏，鲁武公子，周宣王立其为太子",
      },
      {
        name: "鲁废公",
        start: -807,
        end: -796,
        info: "姬伯御，鲁武公长子姬括之子，姬伯御不甘心放弃原本属于他的王位，于是就兴兵作乱，杀死鲁懿公后，自立为君，后周宣王兴兵伐鲁，杀死了伯御，立鲁武公的三子姬敖为君",
      },
      {
        name: "鲁孝公",
        start: -796,
        end: -769,
        info: "姬称，鲁武公子，鲁懿公弟",
      },
      {
        name: "鲁惠公",
        start: -769,
        end: -723,
        info: "姬弗湟，鲁孝公子",
      },
      {
        name: "鲁隐公",
        start: -723,
        end: -712,
        info: "姬息姑，鲁惠公子，本来鲁国太子是姬允，但因其年幼，鲁国大夫们都举荐姬息姑即位，鲁隐公在位期间，鲁国已经初露锋芒，在他的治理下，国家安定，百姓富足，对外，交好郑国，结盟邾国，联姻纪国，进攻许国等，最后姬挥伙同姬允杀害",
      },
      {
        name: "鲁桓公",
        start: -712,
        end: -694,
        info: "姬允，鲁惠公子，鲁隐公弟，鲁隐公被杀后即位，其夫人是齐襄公的妹妹文姜，后因发现齐襄公与文姜通奸，被杀死在齐国",
      },
      {
        name: "鲁庄公",
        start: -694,
        end: -662.1,
        info: "姬同，鲁桓公子，姬同继位后，在长勺之战中，通过与曹刿的密切配合，合理的战术，成功逆袭，以弱胜强，后又劫持齐桓公，齐国归还了以前侵占鲁国的土地",
      },
      {
        name: "鲁君",
        start: -662.6,
        end: -662.9,
        info: "姬斑，鲁庄公子，在位2个月，鲁庄公死后，鲁庄公之弟姬友立姬斑为君，后又被鲁庄公之弟，姬庆父所杀",
      },
      {
        name: "鲁闵公",
        start: -662.9,
        end: -660,
        info: "姬启，鲁庄公子，在位2年，姬斑死后，姬同被姬庆父立为鲁国君主，不到两年，姬庆父又派人将姬启杀害",
      },
      {
        name: "鲁僖公",
        start: -660,
        end: -627,
        info: `姬申，鲁庄公子，鲁闵公弟，姬启死后，姬友佐年少姬申即位，姬友权大，姬友死后，姬申才大权在握，
                姬申虽然没有晋文公的雄才大略，但机敏和生存智慧却丝毫不差于重耳，是个了不起的国君，
                鲁僖公时期，是鲁国最为强盛的时期，一度与齐国争夺东方的霸主，更曾领导诸侯抗衡过楚成王与晋文公`,
      },
      {
        name: "鲁文公",
        start: -627,
        end: -609,
        info: `姬兴，鲁僖公子，期间，周穷困潦倒，为安葬襄王，周顷王直接派人向鲁文公讨钱，自文公始，鲁公室渐衰，
        季孙氏为首的三桓逐渐凌驾于公室之上，外有秦晋争霸，鲁弱而以晋为尊，内有襄仲、三桓争雄`,
      },
      {
        name: "鲁宣公",
        start: -609,
        end: -591,
        info: "姬馁，鲁文公子，大夫襄仲在齐惠公默许下，杀嫡子姬恶及姬视，鲁宣公才得以即位",
      },
      {
        name: "鲁成公",
        start: -591,
        end: -573,
        info: "姬黑肱，鲁宣公子",
      },
      {
        name: "鲁襄公",
        start: -573,
        end: -542,
        info: "姬午，鲁成公子",
      },
      {
        name: "鲁君",
        start: -542.5,
        end: -542.7,
        info: "姬野，鲁襄公子",
      },
      {
        name: "鲁昭公",
        start: -542.9,
        end: -510,
        info: "姬稠，鲁襄公子，姬野弟，鲁昭公伐季孙氏，但大败，鲁昭公逃到齐国，后辗转至晋，最后死在晋国",
      },
      {
        name: "鲁定公",
        start: -510,
        end: -495,
        info: `姬宋，鲁襄公子，在位时鲁国大乱，大权被季孙氏、孟孙氏和叔孙氏控制，他就是个傀儡，后得孔子辅佐，
                正在鲁国经济蒸蒸日上，国富民强时，鲁定公和鲁国的执政官季桓子，沉迷女色，三日不听政，
                祭祀后没按礼送给高级官员祭肉，孔子辞职离鲁`,
      },
      {
        name: "鲁哀公",
        start: -495,
        end: -468,
        info: "姬将，鲁定公子",
      },
      {
        name: "鲁悼公",
        start: -468,
        end: -437,
        info: "姬宁，鲁哀公子",
      },
      {
        name: "鲁元公",
        start: -437,
        end: -416,
        info: "姬嘉，鲁悼公子",
      },
      {
        name: "鲁穆公",
        start: -416,
        end: -383,
        info: "姬显，鲁元公子，在位期间，礼贤下士，以公仪休为相，制定经济改革措施，废除世卿世禄制，组织学派，使鲁国一度出现安定局面",
      },
      {
        name: "鲁共公",
        start: -383,
        end: -353,
        info: "姬奋，鲁穆公子",
      },
      {
        name: "鲁康公",
        start: -353,
        end: -344,
        info: "姬屯，鲁共公子",
      },
      {
        name: "鲁景公",
        start: -344,
        end: -323,
        info: "姬匽，鲁康公子",
      },
      {
        name: "鲁平公",
        start: -323,
        end: -303,
        info: "姬叔，鲁景公子，在位时，鲁国国力衰弱，当时战国七雄中的六国都已经称王，鲁国在列国之中苟延残喘",
      },
      {
        name: "鲁文公",
        start: -303,
        end: -280,
        info: "姬贾，鲁平公子",
      },
      {
        name: "鲁顷公",
        start: -280,
        end: -256,
        info: "姬仇，鲁文公子，鲁国被楚考烈王所灭，顷公出逃于下邑，不久死于柯地，鲁国绝嗣",
      },
    ],
    晋: [
      {
        name: "唐叔虞",
        start: -1033,
        end: -998,
        info: `姬虞, 唐叔虞(生卒年,在位时间不详),字子于，岐周（今陕西岐山）人。西周时期晋国始祖、三晋文化创世人，周武王姬发之子，
              周成王姬诵同母弟，母王后邑姜（齐太公吕尚之女）。在封地唐国，史称唐叔虞。周成王幼冲即位后，皇父周公旦摄政，带兵灭亡唐国后，
              把唐地封给叔虞。启以夏政，强以戎索，政绩斐然可观。唐叔虞死后，其子燮（燮父）继位，迁居晋水之旁，改国号为晋，是为晋侯燮`,
      },
      {
        name: "晋侯燮",
        start: -998,
        end: -963,
        info: `姬燮,一作燮父(生卒年,在位时间不详)，武王孙，叔虞子。唐叔虞死后，晋侯燮继任君位,将国号“唐”改为“晋”。晋侯燮死后，其子晋武侯继位`,
      },
      {
        name: "晋武侯",
        start: -963,
        end: -928,
        info: `姬宁族，铭文作曼期、曼旗(生卒年,在位时间不详)。曾因随周王出巡，受周王赏赐`,
      },
      {
        name: "晋成侯",
        start: -928,
        end: -893,
        info: `姬服人(生卒年,在位时间不详)`,
      },
      {
        name: "晋厉侯",
        start: -898,
        end: -858,
        info: `姬福，别名僰马(生卒年,在位时间不详)`,
      },
      {
        name: "晋靖侯",
        start: -858,
        end: -841,
        info: `姬宜臼，字喜父，厉侯之子.靖侯十七年（前842年），周厉王残暴不仁，周人将他赶出镐京，让周公和召公共同当国，史称“共和”。晋靖侯于次年去世，子僖侯司徒立`,
      },
      {
        name: "晋僖侯",
        start: -840,
        end: -823,
        info: `又称晋釐侯，姬司徒，靖侯子，献侯父。因晋僖侯名司徒，有避讳之说，便废除了当时的司徒官职，到晋文公时期称中军`,
      },
      {
        name: "晋献侯",
        start: -822,
        end: -812,
        info: `姬籍,又名苏,僖侯子`,
      },
      {
        name: "晋穆侯",
        start: -811,
        end: -785,
        info: `姬费王,或名费王、费壬,器铭曰“晋侯邦父”。穆侯四年，取齐女姜氏为夫人。七年，伐条。生太子仇。十年，伐千亩，有功。
          生少子成师。晋人师服认为嫡长子与嫡次子取的名字正相反，晋国迟早会出大乱。穆侯去世后，其弟殇叔自立，太子仇出奔。
          穆侯之孙韩万，乃战国七雄的韩国的先祖`,
      },
      {
        name: "晋殇叔",
        start: -784,
        end: -781,
        info: `名不详,穆侯弟`,
      },
      {
        name: "晋文侯",
        birth: -805,
        start: -780,
        end: -746,
        info: `姬仇,穆侯子,曲沃桓叔兄.前785年,晋穆侯去世,文侯叔父晋殇叔篡夺君位,文侯逃到其他诸侯国避难。
          前781年,文侯以武力夺回君位。晋文侯是晋国历史上一位杰出的君主，他辅佐周平王东迁，诛杀周携王，为东周初年的局势稳定作出很大贡献，
          因此深得周平王的倚重。子伯继位为晋昭侯`,
      },
      {
        name: "晋昭侯",
        start: -745,
        end: -740,
        info: `姬伯,文侯子,于前739年被杀。晋昭侯曾把曲沃封给晋文侯的弟弟桓叔,晋国分裂为翼和曲沃`,
      },
      {
        name: "晋孝侯",
        start: -739,
        end: -724,
        info: `姬平,昭侯子。于前724年为曲沃庄伯所杀`,
      },
      {
        name: "晋鄂侯",
        start: -723,
        end: -718,
        info: `姬郄(或郤),文侯孙，昭侯子，孝侯弟，哀侯父`,
      },
      {
        name: "晋哀侯",
        start: -717,
        end: -709,
        info: `姬光,鄂侯子`,
      },
      {
        name: "晋小子侯",
        start: -708,
        end: -705,
        info: `姬小子,哀侯子`,
      },
      {
        name: "晋侯缗",
        start: -704,
        end: -679,
        info: `姬缗,鄂侯之子,哀侯之弟,侯氏始祖。`,
      },
      {
        name: "晋武公",
        birth: -754,
        start: -704,
        end: -679,
        info: `又称曲沃武公，姬称，穆侯曾孙，曲沃桓叔之孙，曲沃庄伯之子，春秋时期晋国国君。前716年，继父位成为曲沃的国君，
          在吞并晋国前称曲沃武公。公元前678年，杀死晋侯缗，吞并晋国，并以珍宝贿赂周釐王，周釐王便封其为晋国国君，列位诸侯。
          曲沃武公改称晋武公，纪年仍沿用曲沃武公纪年。公元前677年，晋武公去世，其子晋献公继位`,
      },
      {
        name: "晋献公",
        start: -677,
        end: -651,
        info: `姬诡诸，晋国曲沃,因其父活捉戎狄首领诡诸而得名。即位后用士蒍之计，尽灭曲沃桓叔、曲沃庄伯子孙，巩固君位。
          奉行尊王政策，提高声望。攻灭骊戎、耿国、霍国、魏国，击败狄戎，复采纳荀息假道伐虢之计，消灭强敌虞国、虢国，
          史称其“并国十七，服国三十八”`,
      },
      {
        name: "奚齐",
        start: -651,
        end: -650,
        info: `姬奚齐,骊姬之子，献公幼子。他被荀息立为国君，被里克与丕郑所杀，死时仅十四岁`,
      },
      {
        name: "晋惠公",
        start: -651,
        end: -637,
        info: `姬夷吾,献公之子,文公弟.在秦国的帮助下继位。晋惠公继位后，背信弃义，诛杀大臣，国人都很不顺服他。
          太子圉继位，是为晋怀公`,
      },
      {
        name: "晋怀公",
        start: -637,
        end: -637.9,
        info: `姬圉，早年在秦国做人质。怀公的伯父重耳在秦穆公支持下回国，晋怀公的心腹吕省和郤芮都临阵倒戈，
          晋怀公被迫出奔高梁，很快被即位为文公的重耳派人杀死`,
      },
      {
        name: "晋文公",
        start: -638,
        end: -628,
        info: `姬重耳，献公子，母狐姬。文公文治武功卓著，是春秋五霸中第二位霸主，与齐桓公并称“齐桓晋文”。
          骊姬之乱时被迫流亡在外十九年，前636年春在秦穆公的支持下回晋杀晋怀公而立。在位期间任用狐偃、先轸、
          赵衰、贾佗、魏犨等人实行通商宽农、明贤良、赏功劳等政策，作三军六卿，使晋国国力大增。
          对外联合秦国和齐国伐曹攻卫、救宋服郑，平定周室子带之乱，受到周天子赏赐。前632年，在城濮之战以少胜多，
          大败楚军，并召集齐、宋等国于践土会盟，成为春秋五霸中第二位霸主，开创了晋国长达百年的霸业`,
      },
      {
        name: "晋襄公",
        start: -628,
        end: -621,
        info: `姬驩，文公/逼姞子。于肴之战和彭衙之战中大败秦国，又在汦水之战中击败强楚，继其父为中原霸主，
          垂拱而治，将晋国霸权再次推向高峰。春秋霸主。北伐狄人，南略楚国，东征卫国，西征秦国，重组六卿`,
      },
      {
        name: "晋灵公",
        start: -620,
        end: -607,
        info: `姬夷皋，文公孙，襄公子.幼年继位，年长后喜好声色，宠信屠岸贾，不行君道，荒淫无道，
          以重税来满足奢侈的生活，致使民不聊生。最终遭赵盾、赵穿兄弟杀害`,
      },
      {
        name: "晋成公",
        start: -607,
        end: -600,
        info: `姬黑臀,文公之子,襄公异母弟,灵公的叔叔，母为周王室之女. 早年在东周作人质。恢复公族官职，
          并馀子、公行官职，以卿士的嫡子、庶子担任。后与郑国结盟，多次派兵援救郑国；联合白狄打败秦国，俘虏秦国将领。
          前600年，在扈邑会见各国诸侯。同年九月，晋成公在扈邑去世，其子公子据继位，是为晋景公`,
      },
      {
        name: "晋景公",
        start: -599,
        end: -581,
        info: `姬獳，一名据，文公孙、成公子. 在柳棼之战和颖北之战先后击败楚庄王率领的楚军，但在前597年的邲之战被楚国打败，
          使楚庄王成为霸主；前583年派兵在晋伐蔡攻楚破沈之战中攻入楚国本土 ，使楚国霸业结束。在前589年的晋齐鞌之战中，派兵击败齐国。
          晚年将国都由绛迁往新田（今山西侯马），并改称新绛。又发兵消除专政的赵氏家族，取得了公室对卿族的第一次胜利。子晋厉公继位`,
      },
      {
        name: "晋厉公",
        start: -580,
        end: -574,
        info: `姬寿曼,《左传》作名州蒲,景公之子，春秋时期晋国第27任君主. 与秦桓公订盟，但后来秦桓公急欲向东发展而背约，与狄合力攻晋。
          前578年（鲁桓公二十六年），晋使吕相绝秦，并率诸侯伐秦，秦军大败，退至泾`,
      },
      {
        name: "晋悼公",
        birth: -586,
        start: -574,
        end: -558,
        info: `姬周，一作纠，又名周子或孙周，惠伯谈(姬谈)幼子，祖父桓叔捷（姬捷）为襄公二子。堂叔厉公被弑，被迎立为君。谥号为“悼”，爵位为侯，又称“晋侯周”，简称“晋周”。
          幼时聪明伶俐，师从单襄公（单国国君，擅长预言），兼备贤君和相臣的才能，很有当国君的希望，从小就有入主晋国为君的雄心大志。
          十四即位，以韩、栾为股肱（辅政大臣），祁、杨为谋士，重用韩厥、智罃、魏绛、赵武等一干贤臣，严军纪而恤民力，治律历而行礼法，
          于是晋宗谐睦，举国大治，戎狄亲附，惠及中原，华夏尽附。悼公矫天子之命，僭天子之尊，十年之功，以靖外难。晋国在其治下，国势鼎盛，
          军治万乘，铸造军国霸权，挟天子而令诸侯，和戎狄以征四方，最终得以再次称霸中原。联宋纳吴，八年九合诸侯，将晋国霸业推至巅峰。
          终晋悼公朝，晋国镇齐、慑秦、疲楚，天下不能与之争衡`,
      },
      {
        name: "晋平公",
        start: -557,
        end: -532,
        info: `姬彪，悼公子，初，与楚国发生湛阪之战，胜。前552年，同宋、卫等国结盟，再度恢复晋国的霸业。后大兴土木、不务政事，大权旁落至六卿。
          子公子夷继位，是为晋昭公。`,
      },
      {
        name: "晋昭公",
        start: -532,
        end: -526,
        info: `姬夷。平公子。晋渐失去霸主位。子顷公去疾继位`,
      },
      {
        name: "晋顷公",
        start: -525,
        end: -512,
        info: `姬弃疾，昭之子。六卿渐大，积极向公室夺权。顷公十二年，智文子联合晋国的赵氏、韩氏、魏氏、范氏、中行氏消灭了公族祁氏、羊舌氏。
          十三年（前513年）冬，赵简子、范献子收全国生铁四百八十斤，把范宣子制定的“刑书”，铭铸于大铁鼎上，成为晋国的第一部成文法典，史称“铸刑鼎”`,
      },
      {
        name: "晋定公",
        start: -511,
        end: -475,
        info: `姬午，顷公子。即位，荀寅意灭赵氏。晋定公十二年，晋卿赵简子的家臣董安于筑晋阳城，是太原第一座古城。
          晋定公十五年（前497年），赵简子升任晋国正卿，赵鞅囚禁同族赵午，随后杀之。晋定公十九年（前493年），赵鞅率军迎战增援范氏、中行氏，
          誓师“克敌者，上大夫受县，下大夫受郡，士田十万，庶人工商遂，人臣隶圉免”晋军大振，取得胜利。晋定公三十年，定公与吴王夫差争长于黄池，
          吴王曰：于周室我为长。晋定公曰：于姬姓我为伯`,
      },
      {
        name: "晋出公",
        start: -474,
        end: -452,
        info: `姬凿，定公子。是位傀儡君主。公元前453年，国内韩、赵、魏三卿联手打败执政的智氏，完全架空国君。
          晋出公不满三卿过度僭越，被迫流亡于楚国，客死他乡`,
      },
      {
        name: "晋哀公",
        start: -451,
        end: -434,
        info: `晋懿公，晋敬公，姬骄，昭公曾孙。晋昭公生戴子雍，戴子雍生忌，忌生晋哀公。前453年，韩、赵、魏共灭智伯瑶，三分其地，
          并于明年赶走晋出公，立晋哀公。晋国实际上已被三家瓜分，韩、赵、魏掌权`,
      },
      {
        name: "晋幽公",
        start: -433,
        end: -416,
        info: `姬柳，哀公子。赵烈侯，韩景侯，魏文侯瓜分晋国的一些领地，但三家并不是诸侯国，晋幽公恐惧三家权力，反而要朝见赵，韩，魏之君。
          晋幽公十八年（前416年），晋幽公淫妇人，夜窃出邑中，被盗所杀。晋幽公死后，魏文侯以兵诛晋乱，立晋幽公的儿子公子止(一说是晋幽公的弟弟)为国君，是为晋烈公。`,
      },
      {
        name: "晋烈公",
        start: -415,
        end: -389,
        info: `姬止，幽公子。晋烈公十三年（前403年），三家分晋。从此魏国、韩国、赵国成为诸侯国。`,
      },
      {
        name: "晋孝公",
        start: -388,
        end: -377,
        info: `古本竹书》称作晋桓公，名颀，烈公子`,
      },
      {
        name: "晋静公",
        start: -376,
        end: -349,
        info: `又称晋靖公、晋后悼公。姬俱酒，晋最后君主，孝公子`,
      },
    ],
    郑: [
      {
        name: "郑桓公",
        birth: -839,
        start: -806,
        end: -771,
        info: `姬友，周厉王之少子，周宣王之幼弟.桓公初封于郑，都棫林（今陕西华县东）。
                周幽王时任司徒，幽王八年丁卯（前774），公见王室多故，采纳太史伯建议，将其财产和国人、家属等，
                东迁虢、郐两国之间，居十邑之地，做为建设郑国的基地，史称“桓公寄孥”。周幽王十一年（前771）
                犬戎破西周，公勤王殉国。桓公是郑国第一任国君，郑氏开国太始祖，国系一世祖，在位三十六年，开创了郑国431年基业。
                葬于陕西华州螺钉厂内，现河南荥阳郑氏祖茔建有桓公衣冠冢。公妣未详，生三子：掘突、岌、清`,
      },
      {
        name: "郑武公",
        start: -770,
        end: -744,
        info: `姬掘突，桓公子，前771犬戎破西周，会晋、卫、秦诸侯平难，立宜臼为平王，并护平王东迁洛邑，被赐虎牢以东之地。
        后二年，公亦为司徒。实施“武公之略”，灭虢、郐，建立强大郑国。好贤爱民，国人爱之，为赋《缁衣》。
        妣武姜（申侯之女），生子三：子吕、寤生、叔段`,
      },
      {
        name: "郑庄公",
        birth: -752,
        start: -743,
        end: -701,
        info: `姬寤生。英明睿智，励精图治，远交近攻，击败宋、卫来犯之军，战胜周桓王所率四国伐郑之师，消灭入侵的北狄之兵，
        援助齐国驱逐山戎，夺取许戴郕三国之都，使得东方郑国更加强大并达到全盛时期，为郑国431年基业奠定了基础，史称“春秋小霸”。
        公妣邓曼，继妣宋雍氏女，生子：忽、突、子瀕、子亹、子儀、子婴、貝......等十二人`,
      },
      {
        name: "郑昭公",
        start: -701,
        end: -702,
        info: `姬忽。庄公子. 前701年继国君位，次年厉公立，昭公奔卫。前695年，昭公复立，前后在位二年余，公妣陈妫，生子：宏`,
      },
      {
        name: "郑厉公",
        start: -702,
        end: -696,
        info: `姬突. 庄公子. 昭公奔卫`,
      },
      {
        name: "郑昭公",
        start: -695,
        end: -694,
        info: `姬忽。庄公子, 前695年，昭公复立，前后在位二年余`,
      },
      {
        name: "郑君亹",
        start: -694,
        end: -693,
        info: `子亹，庄公子, 在位一年,无谥号`,
      },
      {
        name: "郑君仪",
        start: -693,
        end: -679,
        info: `子仪，又作子婴，亦称郑子，庄公子, 子亹弟，在位十四年`,
      },
      {
        name: "郑厉公",
        start: -679,
        end: -673,
        info: `姬突. 庄公子, 二次在位`,
      },
      {
        name: "郑文公",
        start: -672,
        end: -627,
        info: `姬踕。厉公子。公妣江氏、苏氏。如夫人陈妫、燕姞，生十子：子华、子臧、子兰、子士、子班、子瑕、子般、子语、俞弥、子成`,
      },
      {
        name: "郑穆公",
        start: -628,
        end: -606,
        info: `缪公，姬兰，文公子，郑国七穆的祖先.`,
      },
      {
        name: "郑灵公",
        start: -605,
        end: -604,
        info: `姬夷。穆公子. 在位一年`,
      },
      {
        name: "郑襄公",
        start: -604,
        end: -587,
        info: `姬坚。穆公子.`,
      },
      {
        name: "郑悼公",
        start: -686,
        end: -585,
        info: `姬费或晞, 郑襄公子`,
      },
      {
        name: "郑成公",
        start: -684,
        end: -571,
        info: `姬睔, 郑襄公子`,
      },
      {
        name: "郑君繻",
        start: -570.1,
        end: -570.2,
        info: `姬繻, 前581在位一个月 郑襄公子`,
      },
      {
        name: "郑釐公",
        start: -570.3,
        end: -566,
        info: `姬恽, 郑成公子`,
      },
      {
        name: "郑简公",
        start: -565,
        end: -530,
        info: `姬嘉, 郑釐公子`,
      },
      {
        name: "郑定公",
        start: -529,
        end: -514,
        info: `姬宁,郑简公子`,
      },
      {
        name: "郑献公",
        start: -513,
        end: -501,
        info: `姬趸, 郑定公子`,
      },
      {
        name: "郑声公",
        start: -500,
        end: -464,
        info: `姬胜, 郑献公子`,
      },
      {
        name: "郑哀公",
        start: -463,
        end: -455,
        info: `姬易, 郑声公子`,
      },
      {
        name: "郑共公",
        start: -453,
        end: -424,
        info: `姬丑, 郑献公子`,
      },
      {
        name: "郑幽公",
        start: -423,
        end: -423.9,
        info: `姬已 前423 郑共公子`,
      },
      {
        name: "郑繻公",
        start: -422,
        end: -396,
        info: `姬骀, 郑幽公子或弟`,
      },
      {
        name: "郑康公",
        start: -395,
        end: -375,
        info: `姬乙, 郑幽公子或弟. 前375年亡于韩国，共传承14或15代，24位君主，432年`,
      },
    ],
    齐: [
      {
        name: "齐太公",
        start: -1046,
        end: -1026,
        info: "吕尚，字子牙，周朝开国元勋，著名的姜太公姜子牙，被封为齐侯，建立齐国",
      },
      {
        name: "齐丁公",
        start: -1026,
        end: -975,
        info: "吕伋，参与平定“武庚之乱”",
      },
      {
        name: "齐乙公",
        start: -975,
        end: -923,
        info: "吕得，发展齐国",
      },
      {
        name: "齐癸公",
        start: -923,
        end: -879,
        info: "吕慈母",
      },
      {
        name: "齐哀公",
        start: -879,
        end: -868,
        info: "吕不辰，纪国国君进谗言，被周天子烹死",
      },
      {
        name: "齐胡公",
        start: -868,
        end: -860,
        info: "吕静，为防继续被纪国陷害，把国都从营丘（临淄）迁往薄姑（临淄西北五十里）",
      },
      {
        name: "齐献公",
        start: -859,
        end: -851,
        info: "吕山，将国都迁回营丘，因营丘临靠淄水，故改名为临淄。",
      },
      {
        name: "齐武公",
        start: -850,
        end: -825,
        info: "吕寿，女儿嫁周天子。",
      },
      {
        name: "齐厉公",
        start: -824,
        end: -816,
        info: "吕无忌，昏聩暴虐，民怨沸腾，被齐胡公之子杀死",
      },
      {
        name: "齐文公",
        start: -815,
        end: -804,
        info: "吕赤，齐厉公的儿子，为父报仇杀死叛乱分子多人",
      },
      {
        name: "齐成公",
        start: -803,
        end: -795,
        info: "吕脱",
      },
      {
        name: "齐庄公",
        start: -794,
        end: -731,
        info: "吕购，春秋战国时期在位最长的国君，推动齐国走上霸主之路",
      },
      {
        name: "齐僖公",
        start: -730,
        end: -698,
        info: "吕禄甫，多次主持多国会盟，多次平定他国争端、内乱，使齐国实现小霸",
      },
      {
        name: "齐襄公",
        start: -797,
        end: -686,
        info: "吕诸儿，昏庸无能，荒淫无道；灭纪国，报齐哀公被烹死之仇；杀死鲁国、郑国两位国君. 齐前废公吕无知，前686年在位2月，杀齐襄公",
      },
      {
        name: "齐桓公",
        start: -685,
        end: -643,
        info: "吕小白，春秋五霸之一，任命管仲为相，励精图治，九合诸侯，尊王攘夷，带领齐国称霸. 齐中废公吕无亏，前643年在位3月",
      },
      {
        name: "齐孝公",
        start: -642,
        end: -633,
        info: "吕昭，与其他公子争王位，齐国霸业告终，走向衰弱",
      },
      {
        name: "齐昭公",
        start: -632,
        end: -613,
        info: "吕潘，参与践土会盟，推举晋文公为霸主. 齐后废公吕舍，前613年在位5月，被杀篡位",
      },
      {
        name: "齐懿公",
        start: -612,
        end: -609,
        info: "吕商人，荒淫好色，权臣当道",
      },
      {
        name: "齐惠公",
        start: -608,
        end: -599,
        info: "吕元",
      },
      {
        name: "齐顷公",
        start: -598,
        end: -582,
        info: "吕无野",
      },
      {
        name: "齐灵公",
        start: -581,
        end: -554,
        info: "吕环，五次讨伐鲁国，均没什么战果，还被晋国率领的联军打败",
      },
      {
        name: "齐庄公",
        start: -553,
        end: -548,
        info: "吕光，与大臣妻子偷情，被大臣杀死",
      },
      {
        name: "齐景公",
        start: -547,
        end: -490,
        info: "吕杵臼，前547年-前490年在位，有晏子辅佐，国内安定. 齐晏孺子吕荼，前489年在位10月",
      },
      {
        name: "齐晏孺子",
        start: -489,
        end: -488,
        info: "吕荼，前489年在位10月",
      },
      {
        name: "齐悼公",
        start: -488,
        end: -485,
        info: "吕阳生，前488年-前485年在位，为权臣田乞所列，田氏专政开始",
      },
      {
        name: "齐简公",
        start: -484,
        end: -481,
        info: "吕壬，被田氏杀死",
      },
      {
        name: "齐平公",
        start: -480,
        end: -456,
        info: "吕骜，割地给田氏",
      },
      {
        name: "齐宣公",
        start: -455,
        end: -405,
        info: "吕积",
      },
      {
        name: "齐康公",
        start: -404,
        end: -386,
        info: "吕贷，田氏取代吕氏统治齐国. 至此，姜姓、吕氏建立的齐国宣告灭亡，田氏统治的齐国正式登台",
      },
    ],
    秦: [
      {
        name: "秦非子",
        start: -900,
        end: -858,
        info: `嬴姓,名非子,号秦嬴,伯益后裔,商朝重臣恶来五世孙,秦国开国君主,陕西犬丘人。善养马得到周孝王赏识,获封秦地,成为秦国始封君,号称秦嬴。
              前858年去世,子秦侯继任君位`,
      },
      {
        name: "秦侯",
        start: -857,
        end: -848,
        info: `其名失传,秦非子之子`,
      },
      {
        name: "秦公伯",
        start: -848,
        end: -845,
        info: `秦公伯,秦侯之子,在位三年,史书记载很少,事迹失考,其子秦仲`,
      },
      {
        name: "秦仲嬴仲",
        start: -845,
        end: -822,
        info: `秦仲嬴仲,公伯长子。前824年被周宣王任为大夫,令其率军进攻西戎。前822年与西戎交战中,战败阵亡。
          死后,由其子秦庄公即位,生子秦庄公嬴祺,嬴福,嬴禄,嬴寿,梁康伯(嬴康)`,
      },
      {
        name: "秦庄公",
        birth: -850,
        start: -822,
        end: -778,
        info: `嬴其,名祺,秦仲长子,生子世父,秦襄公开`,
      },
      {
        name: "秦襄公",
        birth: -877,
        start: -778,
        end: -766,
        info: `赢开，率军送周平王东迁洛邑，周平王封秦襄公为诸侯，赐给岐西之地。`,
      },
      {
        name: "秦文公",
        start: -765,
        end: -716,
        info: `秦襄公子,名失考. 设史官以纪事,击败西戎,收编周朝遗民,扩地至岐以西地区,岐东之地献给周天子. 制定罪诛三族的刑法,秦人完全从事农业.`,
      },
      {
        name: "秦宪公",
        birth: 726,
        start: -716,
        end: -704,
        info: `赢立,误作秦宁公,秦竫公子. 父亲早逝,被秦文公立为继承人. 秦静公嬴静(前756-前718)又称秦静公,史记作秦竫公,名静,秦国太子,秦文公子,未继位便去世,享年39岁。
                  前713年夺取亳戎的荡社,前708年俘虏芮国国君芮伯万。前704年消灭西戎荡氏,同年去世,谥号宪公,享年23岁,子秦武公,秦德公嘉,秦出子曼`,
      },
      {
        name: "秦出子",
        birth: 708,
        start: -704,
        end: -698,
        info: `嬴曼,宪公幼子,5岁继位,前698年被杀,时年11岁`,
      },
      {
        name: "秦武公",
        start: -698,
        end: -678,
        info: `嬴说,宪公长子,母鲁姬子,秦德公长兄.初立太子,秦宪公死,弗忌等人立秦出子为国君。后秦出子被弗忌等人杀害,迎回即位。
          在位时诛弗忌等三族,集大权于王室。先后征服绵诸,冀戎,义渠戎和貘等戎族,初设县制管理,次年使秦国势力达到关中渭水流域`,
      },
      {
        name: "秦德公",
        start: -678,
        end: -676,
        info: `嬴嘉, 宪公次子,武公同母弟,武公去世,其子公子白受封于平阳,未能继位,由其继位。前677年将首都迁至雍城,
          用牛羊禽畜祭祀天地,同年梁与芮两国前来朝见。次年初次设立伏祭,在城邑四门杀狗祭祀,祛除传播疾病的暑气。生长子秦宣公,次子秦成公,少子秦穆公`,
      },
      {
        name: "秦宣公",
        birth: 690,
        start: -676,
        end: -664,
        info: `嬴恬,德公长子,秦成公及秦穆公长兄,曾率军攻打晋国,前672年修筑密畤,打败晋国,有9子未立,传位于其弟秦成公`,
      },
      {
        name: "秦成公",
        birth: 687,
        start: -664,
        end: -660,
        info: `嬴载, 宣公弟,梁与芮两国来朝见。子7人皆未立,其弟嬴任好继位`,
      },
      {
        name: "秦穆公",
        start: -660,
        end: -621,
        info: `嬴任好,德公少子,春秋五霸之一,非常重视人才,任用百里奚,蹇叔,公孙枝等重臣,与晋国多次联姻,后来称霸西戎,
          秦国走向昌盛,为秦国统一奠定基石。正室穆姬,晋献公之女,长子秦康公莹,次子公子弘,长女简壁,次女文嬴,三女怀嬴,幼女弄玉`,
      },
      {
        name: "秦康公",
        birth: -660,
        start: -621,
        end: -609,
        info: `嬴莹,穆公子,母穆姬,多次与晋国发生战争,秦国逐渐走向衰落时期`,
      },
      {
        name: "秦共公",
        birth: -636,
        start: -609,
        end: -605,
        info: `嬴稻,名貑,康公子,前607年为了报复晋国入侵崇国,派兵包围焦县,6月晋成公派赵穿等人率军救援`,
      },
      {
        name: "秦桓公",
        birth: -617,
        start: -605,
        end: -577,
        info: `嬴荣,共公子,景公之父,前578年麻隧之战中败于诸侯联军,次年病死,享年41岁,子秦景公石,公子针`,
      },
      {
        name: "秦景公",
        birth: -696,
        start: -577,
        end: -537,
        info: `嬴石,桓公子,在位40年,将秦国势力不断推向中原。前559年晋悼公派荀偃率领鲁国叔孙豹,齐国崔杼,宋国华阅,
          卫国北宫括等联军攻打秦国,到达泾河后却不肯渡河,叔向建议鲁国,莒国先率军渡河`,
      },
      {
        name: "秦哀公",
        start: -537,
        end: -501,
        info: `嬴籍,又作秦毕公,景公之子。前505年吴国攻陷楚国国都,楚大夫申包胥来到秦国求救,但就是不理。
          申包胥在秦国宫门外不走,日夜痛哭。秦哀公发兵救楚,击败吴军,吴王阖闾收兵回国,楚国得以复国,子秦夷公,女伯嬴`,
      },
      //   {
      //     name: "秦夷公",
      //     start: -537,
      //     end: -501,
      //     info: `秦夷公,名不详,秦哀公之子。初立为太子,未即位就病死,不得立,立夷公子秦惠公`,
      //   },
      {
        name: "秦惠公",
        start: -501,
        end: -492,
        info: `嬴宁,夷公子,秦国君主。秦夷公,名不详,秦哀公之子。初立为太子,未即位就病死,秦哀公立其为储。前501年即位,前492年病死`,
      },
      {
        name: "秦悼公",
        start: -492,
        end: -477,
        info: `嬴盘,惠公子`,
      },
      {
        name: "秦厉共公",
        start: -477,
        end: -443,
        info: `嬴刺,又作剌龚公,悼公子,子秦躁公和秦怀公`,
      },
      {
        name: "秦躁公",
        birth: -474,
        start: -443,
        end: -429,
        info: `嬴欣,厉共公子,前430年西戎民族义渠向秦发起进攻,直至渭水蒿域,被秦军击退。弟嬴封返回秦国即位`,
      },
      {
        name: "秦怀公",
        birth: -471,
        start: -429,
        end: -425,
        info: `嬴封,厉共公次子,躁公弟,从晋国迎入为王,当时国政被旧贵族所操纵。前425年秦庶长鼌联合贵族将其逼死,
          时年47岁,太子昭子早卒,次年嬴肃被立为君`,
      },
      {
        name: "秦灵公",
        birth: -438,
        start: -425,
        end: -415,
        info: `嬴肃,怀公孙,父太子昭子。前422年在吴阳建上畤,祭祀黄帝,建下畤,祭祀炎帝。前415年逝世,享年24岁,子师隰年幼,
          悼子便夺位自立为君,师隰被放逐到陇西河谷`,
      },
      {
        name: "秦简公",
        birth: -430,
        start: -414,
        end: -400,
        info: `嬴悼子,怀公子,昭子弟,灵公叔父。在政治和经济上有一定改革,实行按土地亩数征收租税,承认私田的合法性`,
      },
      {
        name: "秦后惠公",
        birth: -412,
        start: -400,
        end: -387,
        info: `嬴仁,简公子,秦国失去河西领土,但也夺取蜀国和南郑`,
      },
      {
        name: "秦出公",
        birth: -389,
        start: -387,
        end: -385,
        info: `嬴昌,史称秦少主,惠公子,前387年惠公死,出公即位年幼,由母主持朝政,重用宦官与外戚,前385年左庶长由菌改发动政变,
          杀其及母,迎秦献公即位`,
      },
      {
        name: "秦献公",
        birth: -423,
        start: -385,
        end: -362,
        info: `嬴师显,又作元献公,名连,灵公子。早年流亡魏国,在位时期进行改革,其中包括废止人殉,迁编制户籍和推广县制,
          发动收复河西失地的战争。前366年打败韩魏两国,使秦国提高了诸侯国的地位。前362年去世,子秦孝公,公子虔和季昌`,
      },
      {
        name: "秦孝公",
        birth: -381,
        start: -362,
        end: -338,
        info: `嬴渠梁,献公嫡子,战国时秦国杰出政治家。统治期间,重用卫鞅实行变法,奖励耕战,迁都咸阳,建立县制行政,加强中央集权。
          同时,不断增进农业生产,并与楚国和亲,与韩订约,联齐赵攻魏国都城安邑,拓地至洛水以东,为秦国奠定了基础。子秦惠文王,樗里疾,公子华,公子少官`,
      },
      {
        name: "秦惠文",
        birth: -356,
        start: -338,
        end: -331,
        info: `王赢驷,孝公子。即位后,将商鞅以车裂处死,前325年自称秦王。当政期间,人才济济,有张仪连横六国,公孙衍,
          司马错等人北伐义渠,西平巴蜀,东出函谷,南下商於,为秦统一中国打下坚实基础`,
      },
      {
        name: "秦武王",
        birth: -329,
        start: -331,
        end: -307,
        info: `嬴荡,又称秦武烈王,惠文王嫡子,平定蜀乱,设丞相,拔宜阳,置三川,更修田律,疏通河道,筑堤修桥。
          身高体壮,喜好跟人比角力,大力士任鄙等人因此做官。前307年与孟说比赛举鼎,结果砸断胫骨,气绝而亡,年仅23岁`,
      },
      {
        name: "秦昭襄王",
        birth: -325,
        start: -307,
        end: -251,
        info: `嬴则,名稷,惠文王子,武王异母弟。早年在燕国做人质,前307年秦武王死,回国后与弟争位。
          在位期间,发生著名的伊阙之战,五国伐齐,鄢郢之战和长平之战。即位初期,由其母宣太后当权,魏冉任咸阳将军,樗里疾为相。
          前304年开始亲理国事,后来听从范雎建议,驱逐了魏冉,并收回了宣太后的权力,拜范雎为相,采用其所提出的远交近攻策略。
          在位期间,击破诸侯国合纵攻秦的策略,四处征伐,鄢郢之战中攻占楚国王都,长平之战中大胜赵军,杀其数十万军队。
          后又攻陷东周王都洛邑,俘虏周赧王,迁九鼎于咸阳,灭亡东周,结束了周朝统治`,
      },
      {
        name: "秦孝文王",
        birth: -302,
        start: -251,
        end: -250,
        info: `嬴柱,亦称安国君,昭襄王次子。在位仅三天,秦国历史上在位最短的国君。初封安国君,前267年立为太子,前250年即位,
          不久去世,享年53岁,子庄襄王继位`,
      },
      {
        name: "秦庄襄王",
        birth: -281,
        start: -250,
        end: -247,
        info: `嬴异人,本名异人,改名为楚,孝文王子,秦始皇之父。曾在赵国邯郸作质子,后在吕不韦帮助下,成为秦国国君。
          前247年五月病逝,享年35岁。秦始皇建立秦朝后,追封太上皇`,
      },
      {
        name: "秦始皇",
        birth: -259,
        start: -247,
        end: -210,
        info: `嬴政,庄襄王之子,秦王朝建立者,政治家,战略家,改革家。生于赵国邯郸,在此地度过了少年时期。
          前247年即位,前238年开始亲理朝政,除掉吕不韦,嫪毐等人,重用李斯和尉缭,从前230-前221年起,
          先后灭韩,赵,魏,楚,燕,齐六国,39岁时完成统一大业,建立统一中央集权的秦朝,采取废除分封制,
          设郡县制,书同文,车同轨,实行统一度量衡。对外北击匈奴,南征百越,修筑万里长城,修筑灵渠,沟通水系。
          前210年病死于沙丘,享年50岁,史称始皇帝。`,
      },
      {
        name: "秦二世",
        birth: -230,
        start: -210,
        end: -207,
        info: `嬴胡亥,秦始皇第18子。少时从赵高学习狱法,前211年随秦始皇出游,次年秦始皇病死沙丘,赵高秘不发丧,
          在赵高与李斯帮助下,杀死兄弟姐妹20余人,并逼死扶苏,当上皇帝。即位后,下令后宫无子者殉葬,
          把一批工匠封死在骊山墓里,征调武士五万人屯卫咸阳。由于实行残暴的统治,终于激起了陈胜,吴广起义,六国贵族复国运动。
          前207年被赵高心腹阎乐逼迫自杀,时年24岁。`,
      },
    ],
  },
  南朝: {
    东晋: [],
    南朝宋: [
      {
        name: "刘裕篡东晋",
        start: 420,
        info: `宋武帝刘裕原为东晋北府兵将领，桓玄之乱后掌握朝廷。发动两次北伐，收复了山东、河南及关中地区（关中后被大夏占领）。
            后杀晋安帝，改立晋恭帝. 两年后（420年）篡夺东晋的帝位，以宋为国号，改元永初，史称刘宋。北魏439年统一北方后，与刘宋形成南北对峙`,
      },
      {
        name: "刘裕篡东晋",
        start: 420,
        info: `宋武帝刘裕原为东晋北府兵将领，桓玄之乱后掌握朝廷。发动两次北伐，收复了山东、河南及关中地区（关中后被大夏占领）。
            后杀晋安帝，改立晋恭帝. 两年后（420年）篡夺东晋的帝位，以宋为国号，改元永初，史称刘宋。北魏439年统一北方后，与刘宋形成南北对峙`,
      },
    ],
    南朝齐: [],
    南朝梁: [],
    南朝陈: [],
  },
  北朝: {},
};

export default data;
