const list = [
  {
    name: "管子",
    start: -723,
    end: -645,
    info: `管仲(公元前723年-约公元前645年),名夷吾,字仲,又称敬仲,春秋时期齐国著名的政治家、军事家，颍上(今安徽颍上)人。
    管仲少时丧父,老母在堂,生活贫苦,不得不过早地挑起家庭重担,为维持生计,与鲍叔牙合伙经商后从军,到齐国，
    几经曲折,经鲍叔牙力荐,为齐国上卿(即丞相),被称为“春秋第一相”，辅佐齐桓公成为春秋时期的第一霸主,所以又说“管夷吾举于士”。
    管仲的言论见于 国语齐语,另有 管子 一书传世`,
  },
  {
    name: "老子",
    start: -571,
    end: -479,
    info: `姓李名耳，字聃，一字伯阳，或曰谥伯阳. 大约于周灵王元年(鲁襄公二年、宋平公五年、公元前571年)出生于陈国苦县。据《史记·老子韩非列传》所说，老子即李耳，
    是楚国苦县厉乡曲仁里人`,
  },
  {
    name: "孔子",
    start: -551,
    end: -479,
    info: `前551年9月28日(有争议)-前479年4月11日. 名丘，字仲尼，春秋末期鲁国陬邑（今山东曲阜市东南）人。
    我国古代著名的思想家、教育家、儒家学派创始人`,
  },
  {
    name: "墨子",
    start: -476,
    end: -390,
    info: `墨子(公元前476或480年—公元前390或420年)，名翟，春秋末期战国初期宋国人，一说鲁阳人，一说滕国人。
    宋国贵族目夷的后裔，曾担任宋国大夫。中国古代思想家、教育家、科学家、军事家，墨家学派创始人和主要代表人物`,
  },
  {
    name: "列子",
    start: -450,
    end: -375,
    info: `列子(约公元前450年—公元前375年),名御寇，亦作圄寇，又名寇，字云。战国前期道家代表人物。
    郑国圃田(今河南郑州)人，古帝王列山氏之后。约与郑繻公同时。先秦天下十豪之一，道学家、思想家、哲学家、文学家、教育家`,
  },
  {
    name: "孟子",
    start: -375,
    end: -289,
    info: `(约公元前372年—公元前289年),名轲，字子舆，邹国（今山东邹城东南）人。战国时期哲学家、思想家、教育家`,
  },
  {
    name: "庄子",
    start: -369,
    end: -286,
    info: `庄子(约公元前369年—约公元前286年),名周，战国时期宋国蒙(古代考城县，一说山东东明县)人.
    战国中期思想家、哲学家、文学家，道家学派代表人物，与老子并称“老庄”`,
  },
  {
    name: "荀子",
    start: -313,
    end: -238,
    info: `荀子(约公元前313年—公元前238年).名况，字卿(一说时人相尊而号为卿)，战国末期赵国人，
    两汉时因避汉宣帝询名讳称“孙卿”，思想家、哲学家、教育家，儒家学派的代表人物，先秦时代百家争鸣的集大成者`,
  },
  {
    name: "韩非子",
    start: -280,
    end: -233,
    info: `韩非(约公元前280年—公元前233年),又称韩非子，战国末期韩国新郑(今属河南)人。中国古代思想家、哲学家和散文家，法家学派代表人物。
    韩非是法家思想之集大成者，集商鞅的“法”、申不害的“术”和慎到的“势”于一身，将辩证法、朴素唯物主义与法融为一体，为后世留下了大量言论及著作。
    其学说一直是中国封建社会时期统治阶级治国的思想基础`,
  },
];

export default info;
