const data = [
  {
    name: "宇宙之始",
    start: -13800000000,
    // end: -2400000,
    events: [
      {
        name: "第一代恒星",
        start: -13300000000,
        info: "万有引力将气体聚集并且加热，第一批恒星发出亮光.恒星通过核反应，产生能量与其万有引力抗衡，并产生了较重的化学元素.",
      },
      {
        name: "太阳",
        start: -5000000000,
        info: "第三代恒星",
      },
      {
        name: "地球",
        start: -4500000000,
        info: "太阳行星",
      },
      {
        name: "细胞",
        start: -3700000000,
        info: "地球生命",
      },
      {
        name: "原始细菌",
        start: -3300000000,
        info: "地球生命",
      },
      {
        name: "有细胞核",
        start: -2700000000,
        info: "地球生命",
      },
      {
        name: "多细胞植物",
        start: -2100000000,
        info: "地球生命",
      },
      {
        name: "叶绿体",
        start: -1250000000,
        info: "海洋中含有叶绿体的泛植物",
      },
      {
        name: "有性生殖",
        start: -1000000000,
        info: "海洋中含有叶绿体的泛植物",
      },
      {
        name: "蠕虫",
        start: -700000000,
        info: "外胚层,中胚层,内胚层间结构",
      },
      {
        name: "寒武纪",
        start: -540000000,
        info: "生命爆发式发展。无脊椎动物迅速发展，身体系统越来越完善，高等无脊椎动物出现",
      },
      {
        name: "脊椎动物",
        start: -450000000,
        info: "脊椎动物在海洋中出现，形成明显的头部，神经系统呈管状，其前端膨大成为脑，后方分化出脊髓",
      },
      {
        name: "陆地植物",
        start: -400000000,
        info: "植物开始向陆地扩张。昆虫成为首批陆生动物",
      },
      {
        name: "两栖类动物",
        start: -367000000,
        info: "陆生植物为两栖动物提供了充足的食物",
      },
      {
        name: "裸子植物",
        start: -300000000,
        info: "裸子植物首次出现了花粉管，花粉管将精子送到卵细胞旁，这样就使植物的生殖摆脱了水的限制",
      },
      {
        name: "爬行动物",
        start: -290000000,
        info: "爬行动物迅速发展",
      },
      {
        name: "爬行动物时代",
        start: -250000000,
        info: "气候改观,统治海洋近三亿年的生物就此衰亡",
      },
      {
        name: "哺乳动物",
        start: -220000000,
        info: "气候改观,统治海洋近三亿年的生物就此衰亡",
      },
      {
        name: "恐龙鼎盛",
        start: -200000000,
        info: "陆上恐龙,水中鱼龙，翼龙,鸟类相继出现了。地球大陆分解为两个大陆，植物和气候变得更加多样。但地球上总体仍然很温暖",
      },
      {
        name: "开花植物",
        start: -130000000,
        info: "花朵提高了植物成功受精的几率，有利于植物基因的传播，蜜蜂和蚂蚁在内的许多昆虫也出现了",
      },
      {
        name: "袋类",
        start: -70000000,
        info: "哺乳动物分化成有胎盘类哺乳动物和有袋类哺乳动物",
      },
      {
        name: "大型爬行动物绝减",
        start: -65000000,
        info: "一颗珠穆朗玛峰大小的陨石击中地球，造成地表气候的大改观，所有大型爬行动物通通都绝减了,哺乳动物和鸟类登上了历史舞台",
      },
      {
        name: "灵长类",
        start: -60000000,
        info: "鼠类和灵长类出现",
      },
      {
        name: "蹄类",
        start: -50000000,
        info: "",
      },
      {
        name: "蝙蝠",
        start: -45000000,
        info: "",
      },
      {
        name: "象类",
        start: -40000000,
        info: "",
      },
    ],
  },
  {
    name: "人类起源",
    start: -2400000,
    end: -3000,
    info: `A “human” is anyone who belongs to the genus Homo (Latin for “man”). 
          One of the earliest known humans is Homo habilis, or “handy man,” 
          who lived about 2.4 million to 1.4 million years ago in Eastern and Southern Africa`,
    events: [
      {
        name: "能人",
        standard: "Homo habilis",
        start: -2400000,
        location: "非洲",
        info: `史前的人类祖先`,
      },
      {
        name: "硕壮人",
        standard: "Homo rudolfensis",
        start: -1900000,
        location: "非洲",
        info: "卢多尔夫智人",
      },
      {
        name: "直立人",
        standard: "Homo erectus",
        start: -1890000,
        location:
          "Southern Africa all the way to modern-day China and Indonesia",
        info: "",
      },
      { name: "元谋", start: -1700000, location: "云南元谋" },
      {
        name: "海德堡人",
        standard: "Homo heidelbergensis",
        start: -600000,
        location: "非洲",
        info: `The closest relatives to modern human beings.`,
      },
      {
        name: "Neanderthals",
        standard: "Neanderthals",
        start: -400000,
        location: "非洲",
        info: `海德堡人 moved to Europe.`,
      },
      {
        name: "Denisovans",
        standard: "Denisovans",
        start: -390000,
        location: "非洲",
        info: "海德堡人 moved to Asia.",
      },
      {
        name: "早期智人",
        standard: "Homo sapiens",
        start: -250000,
        location: "非洲",
        info: "曾称古人, 生活在距今25万～4万年前",
      },
      {
        name: "晚期智人",
        standard: "Homo sapiens",
        start: -50000,
        location: "非洲",
        info: "亦称新人, 距今四五万年前开始出现. 现代人祖先.",
      },
      { name: "北京人", start: -70000, end: -20000, location: "北京周口店" },
      { name: "山顶洞人", start: -18000, format: "氏族公社" },
      { name: "河姆渡/半坡", start: -5000, end: -3000, format: "母系氏族公社" },
      // { name: "大汶口", start: -3000, end: -2000, format: "父系氏族公社" },
    ],
  },
  {
    name: "黄帝",
    start: -2697, // 黄帝元年
    end: -2070,
    info: "炎帝,黄帝,尧,舜,禹",
  },
  { name: "夏", start: -2070, end: -1559 },
  {
    name: "商",
    start: -1559,
    end: -1045,
    events: [{ name: "盘庚迁殷", start: -1300 }],
  },
  {
    name: "西周",
    start: -1046,
    end: -771,
    events: [
      { name: "国人暴动", start: -841 },
      { name: "犬戎攻周", start: -771 },
    ],
    notable: [],
  },
  {
    name: "东周",
    info: "周平王迁都洛邑",
    start: -770,
    end: -256,
    events: [
      { name: "春秋", start: -770, end: -476 },
      { name: "王子克之乱", start: -693 },
      { name: "齐桓公称霸", start: -681 },
      { name: "武公君晋", start: -678 },
      {
        name: "泓水之战",
        start: -638,
        info: "宋襄公讨伐郑国，与救郑楚兵战于泓水。宋襄公讲究“仁义”，要待楚兵渡河列阵后再战，结果大败受伤，次年伤重而死，后葬于襄陵",
      },
      { name: "王子带之乱", start: -636 },
      { name: "弭兵会盟/晋楚同霸", start: -546 },
      { name: "三家分晋", start: -403 },
      { name: "田和代齐", start: -386 },
      // { name: "战国", start: -475, end: -221 },
      { name: "商鞅变法", start: -356, end: -350 },
      { name: "秦灭周", start: -256 },
    ],
    notable: {
      china: [
        {
          name: "老子",
          start: -571,
          info: "",
        },
        {
          name: "孔子",
          start: -551,
          info: "",
        },
      ],
      world: [],
    },
  },
  {
    name: "秦",
    info: "秦统天下,确立郡县制,统一货币,度量衡和文字",
    start: -221,
    end: -206,
    events: [
      { name: "大泽乡起义", info: "陈胜 吴广起义爆发", start: -209 },
      { name: "巨鹿之战", info: "巨鹿之战", start: -207 },
      { name: "秦亡", info: "刘邦攻入咸阳", start: -206 },
    ],
  },
  { name: "西楚", start: -206, end: -202 },
  {
    name: "西汉",
    info: "",
    start: -202,
    end: 8,
    events: [
      {
        name: "张骞出西域",
        info: "公元前138年~119年 张骞两次出使西域",
        start: -138,
      },
    ],
  },
  {
    name: "新",
    info: "王莽夺取西汉政权　改国号新. 至23年",
    start: 8,
    end: 23,
    events: [
      { name: "绿林赤眉起义", info: "17~18年 绿林赤眉起义爆发", start: 17 },
    ],
  },
  // { name: "玄汉", start: 23, end: 25 },
  {
    name: "东汉",
    info: "",
    start: 25,
    end: 220,
    events: [
      { name: "班超出西域", info: "", start: 73 },
      { name: "造纸术", info: "蔡伦改进造纸术", start: 105 },
      { name: "地动仪", info: "张衡创造", start: 132 },
      { name: "黄巾起义", info: "张角领导黄巾起义", start: 184 },
      { name: "官渡之战", info: "", start: 200 },
      { name: "赤壁之战", info: "", start: 208 },
    ],
  },
  {
    name: "三国",
    info: "",
    start: 220,
    end: 280,
    events: [
      { name: "曹魏", info: "220年到280年 220年 魏国建立", start: 220 },
      { name: "蜀汉", info: "221年 蜀国建立", start: 221 },
      { name: "东吴", info: "222年 吴国建立", start: 222 },
    ],
  },
  { name: "西晋", start: 265, end: 316 },
  { name: "东晋", start: 316, end: 420 },
  { name: "南北朝", start: 420, end: 689 },
  { name: "隋", start: 581, end: 618 },
  {
    name: "唐",
    start: 618,
    end: 907,
    events: [
      {
        name: "玄武门之变",
        start: 626,
        info: "六月，李世民伏兵玄武门，杀太子建成及齐王元吉八月，李世民即位，是为唐太宗。东突厥入逼长安，唐太宗亲临渭水，与颉利可汗结便桥之盟，突厥退兵",
      },
      {
        name: "松赞干布",
        start: 629,
        info: "松赞干布即吐蕃赞普位",
      },
      {
        name: "亡东突厥",
        start: 630,
        info: "李靖俘颉利可汗，东突厥亡。日本遣唐使抵唐",
      },
      {
        name: "文成公主入吐蕃",
        start: 641,
        info: "文成公主入吐蕃，与松赞干布和亲",
      },
      {
        name: "玄奘取经还",
        start: 645,
        info: "玄奘取经还，抵长安。太宗征辽东，无功而还。铁勒九姓大首领率众降唐。《大唐西域记》成书",
      },
      {
        name: "太宗去世",
        start: 649,
        info: "五月，太宗去世。六月，太子治即位，是为唐高宗李治",
      },
      {
        name: "陈硕真起义",
        start: 653,
        info: "睦州女子陈硕真起义，自称文佳皇帝，不久，失败",
      },
      {
        name: "武则天为后",
        start: 655,
        info: "废王皇后，立武则天为皇后",
      },
      {
        name: "亡西突厥",
        start: 657,
        info: "苏定方擒阿史那贺鲁，西突厥亡。唐以其地分置崑陵、濛池二都护府，并隶安西都护",
      },
      {
        name: "破百济",
        start: 660,
        info: "苏定方破百济，擒其王",
      },
      {
        name: "吐蕃破吐谷浑",
        start: 663,
        info: "吐谷浑为吐蕃所破，其可汗诺曷钵率众内附，居于凉州",
      },
      {
        name: "灭高丽",
        start: 668,
        info: "高丽内乱，唐遣李勣等攻灭之，俘其王高藏，以其地置安东都护府",
      },
      {
        name: "义净赴天竺",
        start: 671,
        info: "义净自广州浮海赴天竺学佛学",
      },
      {
        name: "高宗去世",
        start: 683,
        info: "高宗去世，太子显即位，是为中宗，武则天执政",
      },
      {
        name: "徐敬业起兵",
        start: 684,
        info: "二月，中宗被废，弟李旦立，是为睿宗，武则天执政.九月，徐敬业于扬州起兵反武则天，三个月后兵败被杀",
      },
      {
        name: "安西四镇失守",
        start: 686,
        info: "唐军为吐蕃所败，安西四镇再度失守",
      },
      {
        name: "武则天称帝",
        start: 690,
        info: "武则天废睿宗，称帝，改国号为周",
      },
      {
        name: "夺回安西四镇",
        start: 692,
        info: "武则天遣王孝杰等大破吐蕃，夺回安西四镇",
      },
      {
        name: "摩尼教入唐",
        start: 694,
        info: "摩尼教由波斯人佛多诞传入唐",
      },
      {
        name: "契丹叛唐",
        start: 696,
        info: "契丹李尽忠与孙万荣等叛唐，陷营州，攻略河北诸州。唐诏山东近边诸州置武骑团兵，以御契丹",
      },
      {
        name: "突骑施朝唐",
        start: 699,
        info: "突骑施首领乌质勒遣子朝唐.突騎施是乌孙后裔，西突厥五咄陆部之一，西突厥被唐朝打败后，隶属五咄陆部的濛池都护继往绝可汗阿史那斛瑟罗，号为莫贺达干",
      },
      {
        name: "置武举",
        start: 702,
        info: "始置武举,分安西都护府天山以北之地为北庭都护府，治庭州，辖西突厥十姓部落",
      },
      {
        name: "武则天退位",
        start: 705,
        info: "正月，张柬之、崔玄暐等人发动政变，杀张易之、张昌宗，逼武则天退位，复立中宗李显.二月，复国号唐",
      },
      {
        name: "吐蕃会盟",
        start: 706,
        info: "唐与吐蕃首次会盟",
      },
      {
        name: "太子重俊政变",
        start: 707,
        info: "七月，太子李重俊发动政变，失败被杀",
      },
      {
        name: "金城公主和亲",
        start: 709,
        info: "金城公主和亲于吐蕃赞普弃隶蹜赞",
      },
      {
        name: "韦后临朝",
        start: 710,
        info: "六月，中宗去世，韦后临朝，立子重茂为帝。睿宗子隆基与太平公主发动政变，杀韦后及安乐公主，逼重茂逊位，拥立睿宗",
      },
      {
        name: "开元元年",
        start: 712,
        info: "八月，李隆基即位，是为唐玄宗李隆基",
      },
      {
        name: "渤海郡王",
        start: 713,
        info: "以河北诸州刺史统领团结兵,以靺鞨大祚荣所部为忽汗州，大祚荣为都督，封渤海郡王，其地始专称渤海",
      },
      {
        name: "测子午线",
        start: 725,
        info: "一行与梁令瓒制成铜铸水运浑仪。南宫说等人以一行之术实测子午线1°之长",
      },
      {
        name: "封云南王",
        start: 738,
        info: "封南诏皮罗阁为云南王，赐姓名为蒙归义",
      },
      {
        name: "天宝元年",
        start: 742,
        info: "全国兵数为五十七万四千名，边兵占四十九万",
      },
      {
        name: "回纥灭后突厥",
        start: 745,
        info: "后突厥为回纥所灭.玄宗敕改波斯（景教）寺为大秦寺",
      },
      {
        name: "高仙芝破小勃律",
        start: 747,
        info: "八月，安西四镇节度副使高仙芝破小勃律",
      },
      {
        name: "高仙芝破小勃律",
        start: 749,
        info: "诏停折冲府上下鱼书，府兵制废. 陇右节度使哥舒翰攻拔吐蕃石堡城",
      },
      {
        name: "安禄山三节度",
        start: 750,
        info: "安禄山身兼范阳、平卢、河东三节度使. 安西节度使高仙芝袭破石国.南诏背唐，附吐蕃.",
      },
      {
        name: "鉴真东渡",
        start: 753,
        info: "鉴真抵日本",
      },
      {
        name: "鉴真东渡",
        start: 753,
        info: "鉴真抵日本",
      },
      {
        name: "安史之乱",
        start: 755,
        info: "十一月，安史之乱爆发。唐诏令军事要冲置防御使。十二月，叛军陷洛阳。唐监军边令诚奉诏杀封常清、高仙芝于军中.吐蕃赞普弃松德赞即位",
      },
      {
        name: "玄宗奔蜀",
        start: 756,
        info: `正月，安禄山称帝于洛阳，国号燕。六月，叛军陷潼关。玄宗奔蜀，至马嵬驿，军士哗变，杀杨国忠，玄宗被迫缢杀杨贵妃。
        太子李亨走灵武。叛军陷长安。七月，李亨即位于灵武，是为肃宗`,
      },
      {
        name: "唐军克长安",
        start: 757,
        info: `正月，安禄山为其子安庆绪所杀。九月，唐军与回纥军克长安。十月，唐军克洛阳，安庆绪逃往邺郡`,
      },
      {
        name: "史思明占洛阳",
        start: 759,
        info: `三月，史思明增援安庆绪，败九节度使兵于邺城，旋杀庆绪，还范阳，四月，自称大燕皇帝，九月，攻占洛阳`,
      },
      {
        name: "史思明被杀",
        start: 761,
        info: `史思明为其子史朝义所杀`,
      },
      {
        name: "安史之乱结束",
        start: 763,
        info: `正月，史朝义自缢，余党降唐，安史之乱结束。十月，吐蕃攻占长安十余日，代宗奔陕州。十二月，代宗返长安，神策军扈从，入为禁军`,
      },
      {
        name: "始税青苗地头钱。吐蕃取凉州",
        start: 764,
        info: `广德二年,始税青苗地头钱。吐蕃取凉州`,
      },
      {
        name: "吐蕃取甘肃",
        start: 766,
        info: `大历元年, 吐蕃取甘州、肃州，唐河西节度使徙治凉州`,
      },
      {
        name: "吐蕃取瓜州",
        start: 776,
        info: `十一年,吐蕃取瓜州`,
      },
      {
        name: "代宗去世",
        start: 779,
        info: `五月，代宗去世，太子李适即位，是为唐德宗李适`,
      },
      {
        name: "三镇叛唐",
        start: 781,
        info: `正月，成德李惟岳、淄青李正己、魏博田悦三镇叛唐。二月，山南东道梁崇义亦叛。六月，唐以淮西节度使李希烈讨梁崇义`,
      },
      {
        name: "四王二帝之乱",
        start: 782,
        info: `四月，卢龙节度使朱滔叛。十一月，河北三镇相约称王，又邀淄青李纳称齐王。十二月，李希烈自称建兴王，联合四镇叛`,
      },
      {
        name: "平四王二帝",
        start: 786,
        info: `四月，李希烈为部将所杀，“四王二帝之乱”平`,
      },
      {
        name: "回纥改回鹘",
        start: 788,
        info: `诏定户等，规定三年一定，以为常式, 回纥改称回鹘`,
      },
      {
        name: "吐蕃攻北庭",
        start: 790,
        info: `吐蕃攻占北庭,越年攻占西州`,
      },
      {
        name: "封南诏王",
        start: 794,
        info: `异牟寻与吐蕃绝，联合唐军败吐蕃，受唐封为南诏王`,
      },
      {
        name: "宦官中尉",
        start: 796,
        info: `六月，置左右神策军护军中尉，以宦官为之`,
      },
      {
        name: "海内华夷图",
        start: 801,
        info: `贾耽绘《海内华夷图》，撰《古今郡国县道四夷述》成。杜佑撰《通典》成`,
      },
      {
        name: "日僧空海抵长安",
        start: 804,
        info: `日本学问僧空海抵长安留学`,
      },
      {
        name: "元和国计簿",
        start: 807,
        info: `李吉甫撰《元和国计簿》成，总计全国方镇四十八，州府二百九十五，县一千四百五十三，每岁国家财赋倚办止于东南八道四十四九州，一百十四万户，比天宝税户四分减三`,
      },
      {
        name: "日僧空海抵长安",
        start: 804,
        info: `日本学问僧空海抵长安留学`,
      },
      {
        name: "牛李党争",
        start: 808,
        info: `牛僧孺、李宗闵等应直言极谏科，指陈时政，宰相李吉甫恶之，贬主考官，抑牛僧孺等人，启牛李党争之端`,
      },
      {
        name: "田兴归朝",
        start: 812,
        info: `魏博节度使田季安卒，军中拥立田兴，田兴归命于朝`,
      },
      {
        name: "讨淮西",
        start: 814,
        info: `淮西节度使吴少阳卒，子元济自领军务。唐发诸道兵讨之`,
      },
      {
        name: "平淮西",
        start: 817,
        info: `十月，唐邓随节度使李愬雪夜袭蔡州，擒吴元济，淮西平`,
      },
      {
        name: "平定淄青",
        start: 819,
        info: `平定淄青，成德、卢龙两镇节度使自请入朝，藩镇割据局面暂时平定`,
      },
      {
        name: "三镇独立",
        start: 822,
        info: `魏博镇叛，河北三镇又恢复独立状态`,
      },
      {
        name: "敬宗被杀",
        start: 822,
        info: `十月，敬宗为宦官刘克明等所杀，弟李昂立，是为文宗`,
      },
      {
        name: "南诏陷成都",
        start: 829,
        info: `南诏攻占成都，掠男女工匠数万而去`,
      },
      {
        name: "甘露之变",
        start: 835,
        info: `十一月，文宗与李训、郑注等谋杀宦官，失败，宦官大杀朝臣，史称甘露之变`,
      },
      {
        name: "日僧圆仁来唐",
        start: 838,
        info: `日僧圆仁来唐求法`,
      },
      {
        name: "黠戛斯灭回鹘",
        start: 840,
        info: `正月，文宗去世，弟李炎立，是为唐武宗李炎. 回鹘为黠戛斯所灭。回鹘族人被迫迁徙：其西迁葛逻禄者与邻近部落建哈剌汗国；西南迁西州、龟兹者称西州或高昌回鹘。西迁甘州者称甘州回鹘；亦有南迁附唐及迁入吐蕃者`,
      },
      {
        name: "会昌伐叛",
        start: 844,
        info: `会昌四年,平定泽潞刘稹之叛，史称会昌伐叛`,
      },
      {
        name: "会昌废佛",
        start: 845,
        info: `会昌五年, 武宗下令废佛，同时罢萨宝府、禁毁祆教、景教、摩尼教祠寺，僧徒并令还俗。史称会昌废佛`,
      },
      {
        name: "张议潮起义",
        start: 848,
        info: `张议潮率沙州人民起义，逐吐蕃守将，自摄州事，遣使上表唐朝廷`,
      },
      {
        name: "王仙芝起义",
        start: 875,
        info: `张年初，王仙芝与尚让等起义于长垣，仙芝自称“天补平均大将军兼海内诸豪都统”。五月，黄巢起义于冤句，以应仙芝`,
      },
      {
        name: "黄巢称王",
        start: 878,
        info: `二月，王仙芝战死于黄梅，尚让引余众与黄巢汇合，推黄巢为黄王，号“冲天大将军”。 是岁，义军受阻，遂挥师南下，由浙趋闽`,
      },
      {
        name: "黄巢入长安",
        start: 880,
        info: `十一月，义军克东都。十二月，僖宗与宦官田令孜等奔蜀，义军入长安，黄巢称帝，国号大齐。沙陀李克用兵逼晋阳，后为唐军所败，与其父李国昌逃入鞑靼`,
      },
      {
        name: "黄巢弃长安",
        start: 883,
        info: `四月，黄巢放弃长安东撤. 李克用任河东节度使，自此据太原。朱温任宣武节度使，自此据汴州`,
      },
      {
        name: "黄巢失败",
        start: 884,
        info: `六月，黄巢牺牲于狼虎谷，起义失败`,
      },
      {
        name: "李克用攻长安",
        start: 885,
        info: `僖宗返京。冬，李克用、王重荣攻逼长安，僖宗奔凤翔`,
      },
      {
        name: "李茂贞据凤翔",
        start: 887,
        info: ``,
      },
      {
        name: "王建占成都",
        start: 891,
        info: `王建攻占成都，据有西川`,
      },
      {
        name: "李茂贞攻长安",
        start: 896,
        info: `李茂贞攻长安，昭宗奔华州，依韩建`,
      },
      {
        name: "昭宗还长安",
        start: 898,
        info: ``,
      },
      {
        name: "朱温封梁王",
        start: 901,
        info: `二月，封朱温为梁王。冬，宰相崔胤召朱温入关，谋诛宦官，宦官劫昭宗走凤翔，依李茂贞。朱温兵围凤翔`,
      },
      {
        name: "朱温杀昭宗",
        start: 904,
        info: `正月，朱温逼迁昭宗于洛阳，八月，朱温遣人杀昭宗，立其子李柷，是为哀帝`,
      },
      {
        name: "朱温亡唐",
        start: 907,
        info: `四月，朱温逼哀帝禅让，自即帝位，改名朱晃，是为后梁太祖朱晃，改国号为梁，史称后梁，都开封。唐朝亡`,
      },
    ],
  },
  {
    name: "五代十国",
    start: 907,
    end: 979,
    events: [
      {
        name: "朱温被杀",
        start: 912,
        info: "晋败后梁蓚县之战。后梁太祖朱温被杀，其子朱友珪即位。后梁河中护国节度使朱友谦叛乱",
      },
      {
        name: "辽建国",
        start: 916,
        info: "晋败后梁莘县之战。晋败后梁太原之战。前蜀伐岐之战。耶律阿保机建立辽国",
      },
      {
        name: "杨隆演称吴王",
        start: 919,
        info: "扬州淮南节度使杨隆演即吴王位",
      },
      {
        name: "后唐灭后梁",
        start: 923,
        info: "太原河东节度使李存勖建立后唐。后唐灭后梁开封之战。后唐潞州李继珂之乱",
      },
      {
        name: "李存勖被杀",
        start: 926,
        info: "后唐魏州赵在礼叛乱。后唐庄宗李存勖被杀，明宗李嗣源即位。闽王王延翰被杀，其弟王延钧即位。辽太祖耶律阿保机去世，其子耶律德光即位",
      },
      {
        name: "后晋灭后唐",
        start: 936,
        info: "太原河东节度使石敬瑭建立后晋。后晋灭后唐洛阳之战",
      },
      {
        name: "辽灭后晋",
        start: 946,
        info: "辽灭后晋开封之战",
      },
      {
        name: "刘知远建后汉",
        start: 947,
        info: "太原河东节度使刘知远建立后汉。后汉魏州魏博节度使杜重威叛乱。辽太宗耶律德光去世，其侄耶律兀欲即位。吴越败南唐福州之战。吴越忠献王钱弘佐去世，其弟钱弘倧即位。吴越王钱弘倧被废，其弟钱弘俶即位。楚文昭王马希范去世，其弟马希广即位",
      },
      {
        name: "后周灭后汉",
        start: 951,
        info: "魏州魏博节度使郭威建立后周。太原河东节度使刘崇建立北汉。辽世宗耶律兀欲被杀，其弟耶律述律即位。后周败北汉霍邑之战。南唐灭楚潭州之战",
      },
      {
        name: "柴荣即后周",
        start: 954,
        info: "后周太祖郭威去世，其甥柴荣即位。后周败北汉高平之战。北汉世祖刘崇去世，其子刘承钧即位",
      },
      {
        name: "柴荣去世",
        start: 959,
        info: "后周伐辽之战。后周世宗柴荣去世，其子柴宗训即位",
      },
      {
        name: "赵匡胤建北宋",
        start: 960,
        info: "后周恭帝柴宗训禅位，赵匡胤建立北宋。北宋潞州昭义节度使李筠叛乱。北宋扬州淮南节度使李重进叛乱。南平贞懿王高保融去世，其弟高保勖即位",
      },
    ],
    subline: [
      { name: "五代", start: 907, end: 960 },
      { name: "十国", start: 891, end: 979 },
    ],
  },
  {
    name: "宋",
    start: 960,
    end: 1279,
    events: [{ name: "南宋", start: 1127, info: "" }],
  },
  {
    name: "元",
    start: 1271,
    end: 1368,
    events: [
      {
        name: "蒙古西征",
        start: 1223,
        info: "蒙古第一次西征1223年（蒙古太祖18年）成吉思汗西征结束东返。蒙古第一次西征结束",
      },
      {
        name: "成吉思汗卒",
        start: 1227,
        info: "蒙古太祖21年,成吉思汗病卒。幼子拖雷监国，蒙古灭西夏",
      },
      {
        name: "蒙古灭金",
        start: 1234,
        info: "蒙古太宗6年,蒙古灭金",
      },
      {
        name: "忽必烈即位",
        start: 1259,
        info: "蒙哥亲征南宋, 死于四川军中. 1260年（元世祖中统元年）忽必烈即汗位于开平",
      },
      {
        name: "创蒙古新字",
        start: 1269,
        info: "正式下诏伐南宋襄阳（元世祖至元6年）创蒙古新字",
      },
      {
        name: "国号大元",
        start: 1271,
        info: "始定国号为大元",
      },
      {
        name: "元大都建成",
        start: 1272,
        info: "元世祖至元9年,大都建成。上都成为陪都",
      },
      {
        name: "下樊城襄阳",
        start: 1273,
        info: "元世祖至元10年,元军攻下樊城、襄阳",
      },
      {
        name: "下临安",
        start: 1276,
        info: "元世祖至元13年,元军攻下南宋临安",
      },
      {
        name: "郭守敬授时历",
        start: 1280,
        info: "元世祖至元17年,郭守敬等修成《授时历》",
      },
      {
        name: "远征日本",
        start: 1281,
        info: "元世祖至元18年, 发兵远征日本，遇台风，几乎全军覆没",
      },
    ],
  },
  { name: "明", start: 1368, end: 1644 },
  {
    name: "清",
    start: 1644,
    end: 1912,
    events: [
      {
        name: "虎门销烟",
        start: 1839,
        info: "林则徐虎门销烟",
      },
      {
        name: "第一次鸦片战争",
        start: 1840,
        info: "1840-1842年，第一次鸦片战争，中国开始沦为半殖民地半封建社会",
      },
      {
        name: "南京条约",
        start: 1842,
        info: "1842年，第一个不平等条约-中英《南京条约》签订",
      },
      {
        name: "虎门条约",
        start: 1843,
        info: "1843年，中英《虎门条约》签订",
      },
      {
        name: "中美中法条约",
        start: 1844,
        info: "1844年，中美《望厦条约》和中法《黄埔条约》签订",
      },
      {
        name: "太平天国",
        start: 1851,
        info: "1851-1864年，太平天国运动",
      },
      {
        name: "第二次鸦片战争",
        start: 1856,
        info: "1856-1860年，第二次鸦片战争",
      },
      {
        name: "天津条约",
        start: 1858,
        info: "1858年，中俄、中美、中英、中法《天津条约》签订",
      },
      {
        name: "资政新篇",
        start: 1859,
        info: "1859年，提出在中国发展资本主义方案的第一人：洪仁玕《资政新篇》",
      },
      {
        name: "北京条约",
        start: 1860,
        info: "1860年，中英、中法、中俄《北京条约》签订",
      },
      {
        name: "中法战争",
        start: 1883,
        info: "1883-1885年，中法战争",
      },
      {
        name: "兴中会",
        start: 1894,
        info: "1894年，第一个资产阶级革命团体：兴中会",
      },
      {
        name: "甲午战争",
        start: 1895,
        info: "1894-1895年，甲午中日战争",
      },
      {
        name: "甲午战争",
        start: 1895,
        info: "1894-1895年，甲午中日战争. 1895年，列强侵华进入新阶段的标志：中日《马关条约》签订;第一个以武装起义形式从事民主革命的起义：广州起义;第一个资产阶级维新派的政治团体：强学会",
      },
      {
        name: "戊戌变法",
        start: 1898,
        info: "1898年，戊戌变法",
      },
      {
        name: "义和团",
        start: 1899,
        info: "1899—1900年，义和团运动",
      },
      {
        name: "八国联军侵华",
        start: 1900,
        info: "1900年，八国联军侵华战争， 两宫西狩",
      },
      {
        name: "辛丑条约",
        start: 1901,
        info: "1901年，中国半殖民地半封建社会秩序形成的标志：《辛丑条约》签订",
      },
      {
        name: "中国同盟会",
        start: 1905,
        info: "1905年，中国资产阶级民主革命进入新阶段的标志、第一个全国性的统一的资产阶级革命政党：中国同盟会成立;清政府下令一律停止科举考试",
      },
      {
        name: "萍浏醴起义",
        start: 1906,
        info: "1906年，同盟会成立后发动的第一次大规模的武装起义：萍浏醴起义",
      },
      {
        name: "辛亥革命",
        start: 1911,
        info: "1911年，辛亥革命",
      },
      {
        name: "清帝退位",
        start: 1912,
        info: "清帝退位",
      },
    ],
  },
  {
    name: "中华民国",
    start: 1912,
    events: [
      {
        name: "二次革命",
        start: 1913,
        info: "袁世凯镇压二次革命，同年当选为首任中华民国大总统",
      },
      { name: "中华民国约法", start: 1914 },
      { name: "新文化运动", start: 1915 },
      {
        name: "袁世凯称帝",
        start: 1916,
        info: "袁世凯恢复帝制失败. 1915年12月宣布自称皇帝，改国号为中华帝国，建元洪宪，史称“洪宪帝制”。此举遭到各方反对，引发护国运动，袁世凯不得不在做了83天皇帝之后宣布取消帝制.1916年6月6日因尿毒症不治而亡，归葬于河南安阳",
      },
      {
        name: "五四运动",
        start: 1919,
        info: "新文化运动兴起的标志：陈独秀在上海创办《新青年》;中国新民主主义革命开始的标志：五四运动",
      },
      {
        name: "上海共产主义小组",
        start: 1920,
        info: "中国第一个共产主义小组：上海共产主义小组",
      },
      { name: "共产党成立", start: 1921 },
      {
        name: "国共合作",
        start: 1924,
        info: "国共第一次合作、革命统一战线建立，国民大革命开始的标志：中国国民党一大召开",
      },
      { name: "北伐", start: 1926, end: 1928 },
      {
        name: "皖系段祺瑞下台",
        start: 1926.5,
        info: "皖系军阀段祺瑞、冯国璋、王士珍",
      },
      {
        name: "直系被灭",
        start: 1927,
        info: "直系军阀曹锟、吴佩孚、孙传芳, 被国民革命军消灭",
      },
      {
        name: "奉系垮台",
        start: 1928,
        info: "奉系张作霖,军阀政府垮台,历时十七年的北洋军阀从此覆灭",
      },
      {
        name: "九一八事变",
        start: 1931.9,
        info: "第一次中华苏维埃全国代表大会：在瑞金召开;中华苏维埃共和国临时中央政府成立",
      },
      { name: "伪满洲国成立", start: 1932 },
      { name: "红军长征", start: 1934, end: 1936 },
      {
        name: "遵义会议",
        start: 1935,
        info: "中国共产党从幼稚走向成熟的标志：遵义会议;一二·九运动",
      },
      { name: "西安事变", start: 1936 },
      { name: "抗日战争", start: 1931, end: 1945 },
      {
        name: "全面抗日",
        start: 1937,
        info: "日本发动全面侵华战争、抗日战争全面爆发的标志：七七事变;国民政府正面战场上的第一次大会战：淞沪会战;抗战开始第一次大捷：平型关大捷;南京大屠杀;重庆国民政府成立;第二次国共合作",
      },
      {
        name: "台儿庄战役",
        start: 1938,
        info: "国民正面战场抗战以来最大胜利：台儿庄战役;武汉会战",
      },
      { name: "第一次长沙会战", start: 1939 },
      { name: "百团大战", start: 1940, info: "南京汪伪国民政府成立;百团大战" },
      { name: "皖南事变", start: 1941, info: "围袭新四军事件; 第二次长沙会战" },
      { name: "第三次长沙会战", start: 1942 },
      { name: "豫湘桂战役", start: 1942 },
      {
        name: "日本投降",
        start: 1945,
        info: "中共七大;日本宣布投降;重庆谈判;“双十协定”签订",
      },
      { name: "国共内战", start: 1946, end: 1949 },
      {
        name: "三大战役",
        start: 1948,
        end: 1949,
        info: "辽沈战役、淮海战役、平津战役",
      },
      { name: "渡江战役", start: 1949, info: "国民党政权退往台湾" },
    ],
  },
  {
    name: "中华人民共和国",
    start: 1949,
    events: [
      {
        name: "韩战爆发",
        start: 1950,
        info: "志愿军入朝",
      },
      {
        name: "西藏解放",
        start: 1951,
        info: "",
      },
      {
        name: "完成土改",
        start: 1952,
        info: "",
      },
      {
        name: "韩战结束",
        start: 1953,
        info: "",
      },
      {
        name: "制定宪法",
        start: 1954,
        info: "",
      },
      {
        name: "农业合作化",
        start: 1955,
        info: "",
      },
      {
        name: "解放汽车",
        start: 1956,
        info: "",
      },
      {
        name: "武汉长江大桥",
        start: 1957,
        info: "",
      },
      {
        name: "三面红旗",
        start: 1958,
        info: "",
      },
      {
        name: "原子弹",
        start: 1964,
        info: "",
      },
      {
        name: "文革",
        start: 1966,
        info: "",
      },
      {
        name: "二月逆流",
        start: 1967,
        info: "",
      },
      {
        name: "人造卫星",
        start: 1970,
        info: "",
      },
      {
        name: "返联合国",
        start: 1971,
        info: "",
      },
      {
        name: "中日建交",
        start: 1972,
        info: "尼克松访华",
      },
      {
        name: "杂交水稻",
        start: 1973,
        info: "袁隆平",
      },
      {
        name: "核潜艇",
        start: 1974,
        info: "",
      },
      {
        name: "唐山地震",
        start: 1976,
        info: "唐山大地震",
      },
      {
        name: "792组成",
        start: 1979,
        info: "792",
      },
      {
        name: "香港回归",
        start: 1997,
        info: "7月1日,香港回归祖国",
      },
      {
        name: "澳门回归",
        start: 1999,
        info: "12月20日,澳门回归祖国",
      },
      {
        name: "北京奥运",
        start: 2008,
        info: "8月8日,北京举办第二十九届奥运会,中国取得了金牌51枚、奖牌总数100枚的历史最好成绩",
      },
    ],
  },
  {
    name: "今年",
    start: 2022, // will be replaced runtime
  },
];

export default data;
