const data = [
  {
    name: "宇宙之始",
    start: -13800000000,
    // end: -2400000,
    events: [
      {
        name: "第一代恒星",
        start: -13300000000,
        info: "万有引力将气体聚集并且加热，第一批恒星发出亮光.恒星通过核反应，产生能量与其万有引力抗衡，并产生了较重的化学元素.",
      },
      {
        name: "太阳",
        start: -5000000000,
        info: "第三代恒星",
      },
      {
        name: "地球",
        start: -4500000000,
        info: "太阳行星",
      },
      {
        name: "细胞",
        start: -3700000000,
        info: "地球生命",
      },
      {
        name: "原始细菌",
        start: -3300000000,
        info: "地球生命",
      },
      {
        name: "有细胞核",
        start: -2700000000,
        info: "地球生命",
      },
      {
        name: "多细胞植物",
        start: -2100000000,
        info: "地球生命",
      },
      {
        name: "叶绿体",
        start: -1250000000,
        info: "海洋中含有叶绿体的泛植物",
      },
      {
        name: "有性生殖",
        start: -1000000000,
        info: "",
      },
      {
        name: "蠕虫",
        start: -700000000,
        info: "外胚层,中胚层,内胚层间结构",
      },
      {
        name: "寒武纪",
        start: -540000000,
        info: "生命爆发式发展。无脊椎动物迅速发展，身体系统越来越完善，高等无脊椎动物出现",
      },
      {
        name: "脊椎动物",
        start: -450000000,
        info: "脊椎动物在海洋中出现，形成明显的头部，神经系统呈管状，其前端膨大成为脑，后方分化出脊髓",
      },
      {
        name: "陆地植物",
        start: -400000000,
        info: "植物开始向陆地扩张。昆虫成为首批陆生动物",
      },
      {
        name: "两栖类动物",
        start: -367000000,
        info: "陆生植物为两栖动物提供了充足的食物",
      },
      {
        name: "裸子植物",
        start: -300000000,
        info: "裸子植物首次出现了花粉管，花粉管将精子送到卵细胞旁，这样就使植物的生殖摆脱了水的限制",
      },
      {
        name: "爬行动物",
        start: -290000000,
        info: "爬行动物迅速发展",
      },
      {
        name: "爬行动物时代",
        start: -250000000,
        info: "气候改观,统治海洋近三亿年的生物就此衰亡",
      },
      {
        name: "哺乳动物",
        start: -220000000,
        info: "气候改观,统治海洋近三亿年的生物就此衰亡",
      },
      {
        name: "恐龙鼎盛",
        start: -200000000,
        info: "陆上恐龙,水中鱼龙，翼龙,鸟类相继出现了。地球大陆分解为两个大陆，植物和气候变得更加多样。但地球上总体仍然很温暖",
      },
      {
        name: "开花植物",
        start: -130000000,
        info: "花朵提高了植物成功受精的几率，有利于植物基因的传播，蜜蜂和蚂蚁在内的许多昆虫也出现了",
      },
      {
        name: "袋类",
        start: -70000000,
        info: "哺乳动物分化成有胎盘类哺乳动物和有袋类哺乳动物",
      },
      {
        name: "大型爬行动物绝减",
        start: -65000000,
        info: "一颗珠穆朗玛峰大小的陨石击中地球，造成地表气候的大改观，所有大型爬行动物通通都绝减了,哺乳动物和鸟类登上了历史舞台",
      },
      {
        name: "灵长类",
        start: -60000000,
        info: "鼠类和灵长类出现",
      },
      {
        name: "蹄类",
        start: -50000000,
        info: "",
      },
      {
        name: "蝙蝠",
        start: -45000000,
        info: "",
      },
      {
        name: "象类",
        start: -40000000,
        info: "",
      },
    ],
  },
  {
    name: "人类起源",
    start: -2400000,
    end: -3000,
    info: `A “human” is anyone who belongs to the genus Homo (Latin for “man”). 
          One of the earliest known humans is Homo habilis, or “handy man,” 
          who lived about 2.4 million to 1.4 million years ago in Eastern and Southern Africa`,
    events: [
      {
        name: "能人",
        standard: "Homo habilis",
        start: -2400000,
        location: "非洲",
        info: `史前的人类祖先`,
      },
      {
        name: "硕壮人",
        standard: "Homo rudolfensis",
        start: -1900000,
        location: "非洲",
        info: "卢多尔夫智人",
      },
      {
        name: "直立人",
        standard: "Homo erectus",
        start: -1890000,
        location:
          "Southern Africa all the way to modern-day China and Indonesia",
        info: "",
      },
      { name: "元谋", start: -1700000, location: "云南元谋" },
      {
        name: "海德堡人",
        standard: "Homo heidelbergensis",
        start: -600000,
        location: "非洲",
        info: `The closest relatives to modern human beings.`,
      },
      {
        name: "Neanderthals",
        standard: "Neanderthals",
        start: -400000,
        location: "非洲",
        info: `海德堡人 moved to Europe.`,
      },
      {
        name: "Denisovans",
        standard: "Denisovans",
        start: -390000,
        location: "非洲",
        info: "海德堡人 moved to Asia.",
      },
      {
        name: "早期智人",
        standard: "Homo sapiens",
        start: -250000,
        location: "非洲",
        info: "曾称古人, 生活在距今25万～4万年前",
      },
      {
        name: "晚期智人",
        standard: "Homo sapiens",
        start: -50000,
        location: "非洲",
        info: "亦称新人, 距今四五万年前开始出现. 现代人祖先.",
      },
      { name: "北京人", start: -70000, end: -20000, location: "北京周口店" },
      { name: "山顶洞人", start: -18000, format: "氏族公社" },
      { name: "河姆渡/半坡", start: -5000, end: -3000, format: "母系氏族公社" },
      // { name: "大汶口", start: -3000, end: -2000, format: "父系氏族公社" },
    ],
  },
  {
    name: "黄帝",
    start: -2697, // 黄帝元年
    end: -2070,
    info: "炎帝,黄帝,尧,舜,禹",
  },
  { name: "夏", start: -2070, end: -1559 },
  {
    name: "商",
    start: -1559,
    end: -1045,
    events: [{ name: "盘庚迁殷", start: -1300 }],
  },
  {
    name: "西周",
    start: -1046,
    end: -771,
    events: [
      { name: "国人暴动", start: -841 },
      { name: "犬戎攻周", start: -771 },
    ],
    notable: [],
  },
  {
    name: "东周",
    info: "周平王迁都洛邑",
    start: -770,
    end: -256,
    events: [
      { name: "春秋", start: -770, end: -476 },
      { name: "王子克之乱", start: -693 },
      { name: "齐桓公称霸", start: -681 },
      { name: "武公君晋", start: -678 },
      {
        name: "泓水之战",
        start: -638,
        info: "宋襄公讨伐郑国，与救郑楚兵战于泓水。宋襄公讲究“仁义”，要待楚兵渡河列阵后再战，结果大败受伤，次年伤重而死，后葬于襄陵",
      },
      { name: "王子带之乱", start: -636 },
      { name: "弭兵会盟/晋楚同霸", start: -546 },
      { name: "三家分晋", start: -403 },
      { name: "田和代齐", start: -386 },
      // { name: "战国", start: -475, end: -221 },
      { name: "商鞅变法", start: -356, end: -350 },
      { name: "秦灭周", start: -256 },
    ],
    notable: {
      china: [
        {
          name: "老子",
          start: -571,
          info: "",
        },
        {
          name: "孔子",
          start: -551,
          info: "",
        },
      ],
      world: [],
    },
  },
  {
    name: "秦",
    info: "秦统天下,确立郡县制,统一货币,度量衡和文字",
    start: -221,
    end: -206,
    events: [
      {
        name: "大泽乡起义",
        start: -209,
        info: `大泽乡起义又称“陈胜吴广起义”，是秦末农民战争的一部分，沉重打击了秦朝，揭开了秦末农民起义的序幕，
        是中国历史上第一次大规模的平民起义。秦二世元年(前209年)秋，秦朝廷征发闾左贫民屯戍渔阳，
        陈胜、吴广等900余名戍卒被征发前往渔阳戍边，途中在蕲县大泽乡为大雨所阻，不能如期到达目的地，情急之下，
        陈胜吴广领导戍卒杀死押解戍卒的军官，发动兵变。起义军推举陈胜为将军，吴广为都尉。连克大泽乡和蕲县，
        并在陈县(今河南淮阳)建立张楚政权，各地纷纷响应`,
      },
      {
        name: "巨鹿之战",
        start: -207,
        info: `巨鹿之战，是秦末大起义中，项羽率领数万楚军(后期各诸侯义军也参战)，同秦将章邯、王离所率40余万秦军主力在巨鹿(今河北平乡)进行的一场重大决战性战役，
        也是中国历史上著名的以少胜多的战役之一。项羽破釜沉舟，以大无畏精神在各诸侯军畏缩不进时率先猛攻秦军，带动诸侯义军一起最终全歼王离军，
        并于数月后迫使另20万章邯秦军投降。从此项羽确立了在各路义军中的领导地位。经此一战，秦朝主力尽丧，名存实亡`,
      },
      { name: "秦亡", info: "刘邦攻入咸阳", start: -206 },
    ],
  },
  {
    name: "西楚",
    start: -206,
    end: -202,
    events: [
      // {
      //   name: "巨鹿之战",
      //   start: -207,
      // },
    ],
  },
  {
    name: "西汉",
    info: "",
    start: -202,
    end: 8,
    events: [
      {
        name: "张骞出西域",
        info: "公元前138年~119年 张骞两次出使西域",
        start: -138,
      },
    ],
  },
  {
    name: "新",
    info: "王莽夺取西汉政权　改国号新. 至23年",
    start: 8,
    end: 23,
    events: [
      { name: "绿林赤眉起义", info: "17~18年 绿林赤眉起义爆发", start: 17 },
    ],
  },
  // { name: "玄汉", start: 23, end: 25 },
  {
    name: "东汉",
    start: 25,
    end: 220,
    events: [
      { name: "班超出西域", info: "", start: 73 },
      { name: "造纸术", info: "蔡伦改进造纸术", start: 105 },
      { name: "地动仪", info: "张衡创造", start: 132 },
      { name: "黄巾起义", info: "张角领导黄巾起义", start: 184 },
      { name: "曹操士东郡", info: "曹操任东郡太守", start: 187 },
      {
        name: "汉献帝立",
        start: 189,
        info: "董卓废少帝刘辩为弘农王，立九岁的陈留王刘协为帝",
      },
      {
        name: "诸侯反董卓",
        start: 190,
        info: `1月,各路诸侯起兵反董卓，组成反董卓联盟军，董卓令李儒毒死了15岁的弘农王.
        2月,董卓焚烧洛阳，迁都长安，洛阳古都残破；公孙度自立为辽东侯`,
      },
      {
        name: "袁绍领冀州牧",
        start: 191,
        info: `孙坚破董卓，斩华雄；袁绍夺州牧韩馥的冀州，自领冀州牧`,
      },
      {
        name: "吕布杀董卓",
        start: 192,
        info: `4月,王允设连环计，吕布杀死董卓；6月,李傕、郭汜围长安，杀王允，败吕布.曹操击败青州黄巾军，
        收编为“青州兵”，实力得以壮大.孙坚攻击刘表，战死`,
      },
      {
        name: "曹操败陶谦",
        start: 193,
        info: `曹操东征徐州，大败陶谦`,
      },
      {
        name: "刘备领徐州牧",
        start: 194,
        info: `吕布攻击曹操，陶谦病亡，刘备领徐州牧`,
      },
      {
        name: "曹操领兖州牧",
        start: 195,
        info: `10月,曹操领兖州牧；孙策攻打江东大败刘繇；李傕、郭汜争夺献帝`,
      },
      {
        name: "迎献帝许都",
        start: 196,
        info: `7月,献帝在杨奉等人护送下，回长安；吕布占徐州，刘备投曹操；曹操始兴屯田，将献帝迎接到许都；`,
      },
      {
        name: "曹操讨张绣",
        start: 197,
        info: `袁术在寿春称帝；曹操讨伐张绣，失败；袁绍占领冀、幽、青、并四州`,
      },
      {
        name: "曹操杀吕布",
        start: 198,
        info: `吕布攻打刘备，破小沛；12月,曹操擒杀吕布；周瑜同小乔成亲`,
      },
      {
        name: "董承密除曹操",
        start: 199,
        info: `11月,张绣投降曹操；董承与王子服等密除曹操；孙策袭取庐江，败刘勋；刘备讨伐袁术，袁术病死`,
      },
      {
        name: "官渡之战",
        start: 200,
        info: "曹操诛杀董承一伙；孙策遇刺身亡，孙权继位；陈琳撰写讨曹檄文，官渡之战开始. 10月,曹操偷袭乌巢",
      },
      {
        name: "曹操败袁绍",
        start: 201,
        info: "曹操败袁绍于仓亭；刘备投奔刘表",
      },
      {
        name: "袁绍病死",
        start: 202,
        info: "5月,袁绍病死",
      },
      {
        name: "孙权伐黄祖",
        start: 203,
      },
      {
        name: "曹操定冀州",
        start: 204,
        info: "曹操平定冀州；辽东公孙度死，子公孙康继位；",
      },
      {
        name: "曹操定青州",
        start: 205,
      },
      {
        name: "曹操定并州",
        start: 206,
      },
      {
        name: "三顾茅庐/文姬归汉",
        start: 207,
        info: "8月,曹操大破乌桓，水平袁氏残余势力，统一了北方. 刘备三顾茅庐请出诸葛亮；曹操从南匈奴赎回蔡文姬",
      },
      {
        name: "赤壁之战",
        start: 208,
        info: `6月,曹操封为汉丞相. 7月,曹操南征刘表. 8月,刘表病死；曹操杀孔融；9月,刘琮投降曹操；
        11月,赤壁之战，曹操被孙刘联军打败；`,
      },
      { name: "刘备娶孙妹", info: "刘备与孙权之妹成亲", start: 209 },
      {
        name: "周瑜亡",
        start: 210,
        info: `曹操建成铜雀台；周瑜亡`,
      },
      {
        name: "曹操破马超",
        start: 211,
        info: `曹操攻破马超；刘备入川`,
      },
      {
        name: "曹操南下",
        start: 212,
        info: `10月,曹操南下进攻濡须口；刘备驻扎霞萌关；孙权移治秣陵，改名建业；`,
      },
      {
        name: "曹操进魏公",
        start: 213,
        info: `5月，汉献帝封曹操为魏公，加九锡`,
      },
      {
        name: "献帝谋曹操",
        start: 214,
        info: `5月,孙权攻破宛城；7月,孙权进攻合肥，被张辽击败
        10月,献帝、伏后与国丈伏完密谋除曹操，事泄，曹操诛杀众人；
        刘璋投降刘备，刘备自领益州牧`,
      },
      {
        name: "逍遥津之战",
        start: 215,
        info: `7月,曹操征张鲁；11月,张鲁降曹操；逍遥津之战；曹操在濡须打败孙权`,
      },
      {
        name: "曹操称魏王",
        start: 216,
      },
      {
        name: "曹操败孙权",
        start: 217,
        info: `2月,曹操进攻濡须口，孙权败`,
      },
      {
        name: "曹彰大破乌桓",
        start: 218,
        info: `曹彰大破乌桓军，鲜卑部落投降，北方平定`,
      },
      {
        name: "关羽失荆州",
        start: 219,
        info: `7月,刘备进位汉中王；关羽水淹七军；10月,关羽失荆州，被孙权杀害`,
      },
    ],
  },
  {
    name: "三国",
    info: "",
    start: 220,
    end: 280,
    events: [
      {
        name: "曹魏",
        info: `1月,曹操病亡。10月,曹丕称帝，建魏国(220年~280年)`,
        start: 220,
      },
      { name: "蜀汉", info: "4月,刘备称帝。刘备伐吴。张飞遇害", start: 221 },
      {
        name: "东吴",
        info: "孙权称吴王。彝陵之战，陆逊火烧连营，大败刘备",
        start: 222,
      },
      {
        name: "刘备死",
        info: `4月,刘备死于白帝城，刘禅继帝位.8月,曹丕五路伐蜀。蜀吴重修和好。雍闿叛乱。`,
        start: 223,
      },
      {
        name: "七擒孟获",
        info: `诸葛亮南征。七擒七纵孟获，平定蜀国南方`,
        start: 225,
      },
      {
        name: "曹丕病亡",
        info: `曹丕病亡，曹睿继位。12月,曹睿封司马懿为骠骑大将军。孙权围攻江夏，兵败`,
        start: 226,
      },
      {
        name: "马谡失街亭",
        info: `诸葛亮第一次北伐。姜维降蜀。马谡失街亭。周鲂诈降诱曹魏攻吴，陆逊大败曹休 诸葛亮第二次北伐`,
        start: 228,
      },
      {
        name: "孙权称帝",
        info: `孙权称帝。诸葛亮第三次北伐`,
        start: 229,
      },
      {
        name: "诸葛四次北伐",
        info: `吴派卫温、诸葛直航海到夷洲。诸葛亮第四次北伐。曹真病亡`,
        start: 230,
      },
      {
        name: "诸葛五丈原",
        info: `诸葛亮六出祁山。8月,诸葛亮病逝于五丈原.吴大举攻魏合肥`,
        start: 234,
      },
      {
        name: "司马懿封太傅",
        info: `1月,曹睿封司马懿为太傅。马钧制造司南车和水转百戏`,
        start: 235,
      },
      {
        name: "司马懿平辽东",
        info: ` 辽东公孙渊自立为燕王。238年司马懿平辽东，杀公孙渊。
        日本邪马台女王卑弥呼派使者到魏，魏封卑弥呼为“亲魏倭王”`,
        start: 237,
      },
      {
        name: "孙权攻海南岛",
        info: `孙权派军攻打海南岛`,
        start: 242,
      },
      {
        name: "陆逊忧愤死",
        info: `吴太子孙和与鲁王孙霸争权，陆逊因受牵连，忧愤而死。`,
        start: 245,
      },
      {
        name: "司马懿封丞相",
        start: 248,
      },
      {
        name: "司马懿杀曹爽",
        info: `1月,司马懿杀曹爽一伙。夏侯霸降蜀。姜维伐魏`,
        start: 249,
      },
      {
        name: "司马懿亡",
        info: `7月　 司马懿亡`,
        start: 251,
      },
      {
        name: "孙权亡",
        info: `司马懿长子司马师为大将军。孙权亡，孙亮继位。司马昭攻吴，失败。`,
        start: 252,
      },
      {
        name: "姜维攻魏败",
        info: `诸葛恪进攻魏国，无功而返。姜维攻魏狄道失败。吴孙峻诛杀诸葛恪。`,
        start: 253,
      },
      {
        name: "司马师亡",
        info: `镇东将军毌丘俭与扬州刺史文钦讨伐司马师。司马师亡。司马昭为大将军. 姜维攻魏狄道，先胜后败。`,
        start: 255,
      },
      {
        name: "姜维攻魏失败2",
        info: `魏诸葛诞与孙吴联合起兵反魏。姜维出骆谷攻魏失败`,
        start: 257,
      },
      {
        name: "魏破寿春",
        info: `魏军攻破寿春，斩诸葛诞。孙綝废吴帝孙亮为会稽王，立琅琊王孙休为帝。孙休与丁奉设计杀死孙綝`,
        start: 258,
      },
      {
        name: "邓艾败姜维",
        info: `10月 姜维攻魏，被邓艾击败，退屯沓中`,
        start: 262,
      },
      {
        name: "司马昭亡蜀",
        info: `司马昭三路伐蜀，蜀亡`,
        start: 263,
      },
      {
        name: "司马昭称晋王",
        info: `钟会和姜维密谋失败被杀。司马昭称晋王。孙休亡，孙皓继位`,
        start: 264,
      },
    ],
  },
  {
    name: "西晋",
    start: 265,
    end: 316,
    events: [
      {
        name: "司马炎篡曹魏",
        start: 265,
        info: `司马昭亡，其子司马炎继任晋王。12月 司马炎废曹奂为陈留王，自称晋武帝，定都洛阳,建立西晋，魏亡`,
      },
      {
        name: "陆抗败杨肇",
        start: 272,
        info: "司马炎派杨肇、羊祜等率军支持战略要地西陵。陆抗大败杨肇，杀步阐",
      },
      {
        name: "中原大疫",
        start: 275,
        info: "洛阳死者以万数",
      },
      {
        name: "晋灭吴",
        start: 280,
        info: "279年,晋以贾充为大都督,大举分道伐吴.吴帝孙皓投降, 灭吴,统一全国.颁布户调式,包括占田课田制,户调制和荫客制.",
      },
      {
        name: "竹书纪年",
        start: 281,
        info: "汲郡战国墓中《竹书纪年》等竹简出土",
      },
      {
        name: "晋惠帝立",
        start: 290,
        info: "武帝杨皇后父杨骏辅政.以刘渊为匈奴五部大都督",
      },
      {
        name: "八王之乱始",
        start: 291,
        info: "贾后杀杨骏,又杀汝南王亮及楚王玮;八王之乱开始",
      },
      {
        name: "齐万年起兵",
        start: 296,
        info: "氐人齐万年起兵于关中",
      },
      {
        name: "李特入蜀",
        start: 298,
        info: "关中连年饥荒,巴氐豪酋李特率流民入蜀",
      },
      {
        name: "赵王杀贾后",
        start: 300,
        info: "赵王伦杀贾后",
      },
      {
        name: "赵王伦自立",
        start: 301,
        info: "张轨据河西;赵王伦废惠帝自立,齐王冏等起兵杀伦,惠帝复位,冏专政;秦雍六郡流民起义爆发.流民推李特为首,起兵于绵竹,进攻成都",
      },
      {
        name: "李特入成都",
        start: 303,
        info: "李特入成都,旋为益州刺史罗尚所杀.特侄李雄再攻下成都",
      },
      {
        name: "十六国开始",
        start: 304,
        info: "李雄称成都王,建成汉;匈奴刘渊在左国城即汉王位,建国号曰汉.十六国开始;河间王颙将领张方逼惠帝西迁长安",
      },
      {
        name: "八王之乱结束",
        start: 306,
        info: "东海王越将领祁弘挟惠帝还洛阳.惠帝中毒死,弟炽继位,是为晋怀帝司马炽.八王之乱结束",
      },
      {
        name: "匈奴汉王刘渊死",
        start: 310,
        info: "匈奴汉王刘渊死,太子和继位.刘聪杀和自立",
      },
      {
        name: "司马邺即位",
        start: 313,
        info: "刘聪杀怀帝,秦王司马邺在长安即位,是为晋愍帝司马邺",
      },
      {
        name: "拓跋猗卢封王",
        start: 315,
        info: "晋封拓跋猗卢为代王",
      },
    ],
  },
  {
    name: "东晋",
    start: 316,
    end: 420,
    events: [
      {
        name: "西晋亡",
        start: 316,
        info: "刘曜进兵关中,愍帝降,西晋亡. 317年，琅邪王司马睿即晋王位,史称东晋;祖逖北伐",
      },
      {
        name: "东晋立",
        start: 318,
        info: "晋王睿称帝,是为晋元帝司马睿;刘聪病死,太子粲继位,旋为靳准所杀,汉亡.刘曜发兵攻准,自立为皇帝",
      },
      {
        name: "前后赵立",
        start: 319,
        info: "刘曜徙都长安,改国号赵,史称前赵;石勒自称赵王,定都襄国,史称后赵",
      },
      {
        name: "王敦起兵",
        start: 322,
        info: "王敦起兵武昌,遥制朝政.元帝忧愤死,明帝即位,王导辅政",
      },
      {
        name: "明帝讨王敦",
        start: 324,
        info: "明帝下令讨伐王敦,敦以兄含为元帅攻建康,敦病死,兵众溃散",
      },
      {
        name: "苏峻祖约之乱",
        start: 327,
        info: "苏峻,祖约之乱爆发",
      },
      {
        name: "前赵亡",
        start: 329,
        info: "后赵出兵攻占上邽,杀太子熙,前赵亡",
      },
      {
        name: "后赵石勒称帝",
        start: 330,
        info: "东晋始行度田收租制,亩税三升;后赵石勒称帝",
      },
      {
        name: "后赵迁都于邺",
        start: 335,
        info: "",
      },
      {
        name: "慕容前燕",
        start: 337,
        info: "鲜卑慕容皝称燕王,建燕国,史称前燕",
      },
      {
        name: "拓跋代,李寿汉",
        start: 338,
        info: "鲜卑拓跋什翼犍继代王位;大成国李寿自立,改国号为汉",
      },
      {
        name: "桓温灭成汉",
        start: 347,
        info: "",
      },
      {
        name: "后赵石虎称帝",
        start: 349,
        info: "后赵石虎称帝;谪戍凉州的东宫卫在高力督梁犊领导下于雍城起义",
      },
      {
        name: "冉闵立冉魏",
        start: 350,
        info: "冉闵灭后赵,自立为帝,国号大魏,史称冉魏",
      },
      {
        name: "苻健立前秦",
        start: 351,
        info: "苻健在长安称天王,大单于,国号大秦,史称前秦",
      },
      {
        name: "前燕灭冉魏",
        start: 352,
        info: "前燕慕容皝灭冉魏",
      },
      {
        name: "桓温伐前秦",
        start: 354,
        info: "桓温北伐前秦,军至灞上",
      },
      {
        name: "桓温入洛阳",
        start: 356,
        info: "桓温第二次北伐,入洛阳,留兵戍守而还",
      },
      {
        name: "前秦苻坚即位",
        start: 357,
        info: "前秦苻坚即位,称大秦天王,汉人王猛辅政;前燕迁都于邺",
      },
      {
        name: "桓温破燕军",
        start: 361,
        info: "桓温派兵破燕军,取许昌",
      },
      {
        name: "桓温伐前燕",
        start: 369,
        info: "桓温率军五万北伐前燕,至枋头大败",
      },
      {
        name: "前秦灭前燕",
        start: 370,
        info: "",
      },
      {
        name: "前秦灭前凉,代",
        start: 376,
        info: "前秦灭前凉,灭代;晋废度田收租之制,王公以下口税米三斛,在役者免",
      },
      {
        name: "肥水之战",
        start: 383,
        info: "晋秦肥水之战,前秦大败;晋增收口税米,每口五石",
      },
      {
        name: "姚苌建后秦",
        start: 384,
        info: "鲜卑慕容垂在荥阳称燕王;慕容泓称济北王;羌族姚苌在渭北起兵,史称后秦;后燕慕容垂定都中山",
      },
      {
        name: "慕容冲建西秦",
        start: 385,
        info: "西燕慕容冲称帝,入长安;乞伏国仁自称大单于,筑勇士城,史称西秦",
      },
      {
        name: "拓跋珪建北魏",
        start: 386,
        info: "鲜卑拓跋珪称代王,都盛乐,改称魏;后秦姚苌入长安,称帝;吕光称凉州牧,酒泉公,都姑臧",
      },
      {
        name: "西燕,前秦亡",
        start: 394,
        info: "后燕慕容垂攻破长子,西燕亡;前秦苻登为后秦姚兴所杀,前秦亡",
      },
      {
        name: "北魏败后燕",
        start: 395,
        info: "北魏在参合陂大败后燕",
      },
      {
        name: "南凉之始",
        start: 397,
        info: "鲜卑秃发乌孤称西平王,筑廉川堡为都,此为南凉之始",
      },
      {
        name: "慕容德立南燕",
        start: 398,
        info: "慕容德自立为燕王,史称南燕;拓跋珪迁都平城,称帝,是为魏道武帝拓跋珪",
      },
      {
        name: "西凉之始",
        start: 400,
        info: "李暠自称凉公,都敦煌,西凉始此",
      },
      {
        name: "北凉立",
        start: 401,
        info: "沮渠蒙逊杀段业,自称凉州牧,史称北凉;后秦姚兴迎鸠摩罗什至长安",
      },
      {
        name: "桓玄废晋建楚",
        start: 403,
        info: "桓玄废晋安帝,自称帝,国号楚;后凉降于后秦",
      },
      {
        name: "大夏",
        start: 407,
        info: "赫连勃勃称大夏天王",
      },
      {
        name: "冯跋建北燕",
        start: 409,
        info: "后燕亡.冯跋建立北燕;刘裕北伐南燕",
      },
      {
        name: "南燕亡",
        start: 410,
        info: "刘裕破广固,南燕亡;卢循,徐道覆北进逼建康,为刘裕所败",
      },
      {
        name: "西秦灭凉亡",
        start: 414,
        info: "西秦袭取乐都,秃发傉檀降,南凉亡",
      },
      {
        name: "刘裕灭后秦",
        start: 417,
        info: "刘裕北伐入长安,后秦亡",
      },
    ],
  },
  {
    name: "南北朝",
    start: 420,
    end: 689,
    events: [
      {
        name: "东晋灭亡",
        start: 420,
        info: "宋武帝永初元年，刘裕废晋恭帝自立，改国号为宋，仍都建康，东晋亡，南朝始",
      },
      {
        name: "北魏统一北方",
        start: 439,
        info: "北魏太武帝太延五年，北魏拓跋焘灭北凉，统一中国北方",
      },
      {
        name: "羌氐汉北方起义",
        start: 445,
        info: "太平真君六年，卢水胡人盖吴在杏城（今陕西黄陵）领导起义，羌氐汉等族人民纷纷响应，反对北魏统治",
      },
      {
        name: "北魏南侵宋",
        start: 450,
        info: "太平真君十一年，北魏十六万大军南侵，为宋击退",
      },
      {
        name: "南齐废宋顺帝",
        start: 479,
        info: "齐高帝建元元年，将军萧道成废宋顺帝刘淮自立，改国号为齐，史称南齐或萧齐",
      },
      {
        name: "孝文帝改革",
        start: 485,
        info: "北魏孝文帝太和九年，北魏孝文帝改革，颁布均田令。齐武帝永明元年，唐寓之在富阳（今浙江富阳）领导农民起义。",
      },
      {
        name: "孝文帝迁都洛阳",
        start: 494,
        info: "北魏太和十八年，孝文帝由平城迁都洛阳，继续改革。",
      },
      {
        name: "孝文帝迁都洛阳",
        start: 495,
        info: "北魏太和十九年，孝文帝赐群臣汉族“冠服”，以易鲜卑衣服，在朝廷上禁用鲜卑语",
      },
      {
        name: "萧梁齐亡",
        start: 501,
        info: "齐和帝中兴元年，萧衍杀齐和帝（萧宝融）。次年，自立为帝（梁武帝），改国号为梁，史称萧梁。齐亡。",
      },
      {
        name: "北魏六镇起义",
        start: 523,
        info: "魏孝明帝正光四年，北魏“六镇起义”",
      },
      {
        name: "北魏河阴之变",
        start: 528,
        info: `武泰元年，邢杲在北海（山东潍坊市西南）领导河北流民起义。北魏胡太后毒死孝明帝，立元钊为帝，
        尔朱荣率兵入洛阳，溺杀胡太后和少帝元钊，杀王公卿士一千余人，史称“河阴之变”`,
      },
      {
        name: "东西魏",
        start: 534,
        info: `东魏孝静帝天平元年，孝武帝逃亡关中，投靠宇文泰。北魏分裂，高欢立元善见为帝（孝静帝），
        迁都于邺（今河南安阳一带），是为东魏。宇文泰杀孝武帝，立元宝炬为帝（文帝），都长安，是为西魏。`,
      },
      {
        name: "梁侯景之乱",
        start: 548,
        info: `梁武帝太清二年，“侯景之乱”，次年侯景攻破建康，梁武帝饿死。`,
      },
      {
        name: "高洋北齐",
        start: 550,
        info: `东魏孝敬帝武定八年，高欢死，子高洋废东魏孝敬帝自立，改国号为齐，史称北齐，年号天保`,
      },
      {
        name: "宇文觉北周",
        start: 556,
        info: `梁敬帝绍泰二年，宇文泰死。次年，子宇文觉废西魏恭帝自立，改国号为周。史称北周，亦称宇文周。`,
      },
      {
        name: "陈霸先南陈",
        start: 557,
        info: `梁敬帝太平二年，梁将军陈霸先废梁敬帝自立，改国号为陈，年定永号`,
      },
      {
        name: "杨坚任随州刺史",
        start: 560,
        info: "周武帝宇文邕即位，杨坚出任为随州刺史，进位大将军",
      },
      {
        name: "杨坚袭随国公",
        start: 568,
        info: "杨忠死后，杨坚承袭随国公的爵位",
      },
      {
        name: "杨坚败北齐",
        start: 575,
        info: "杨坚率水军三万，于河桥大败北齐的军队",
      },
      {
        name: "北周灭北齐",
        start: 577,
        info: `北周武帝建德六年，北齐幼主承光元年，北周灭北齐，统一北方。`,
      },
      {
        name: "杨坚进位柱国",
        start: 576,
        info: "杨坚从周武帝亲征平齐，进位柱国. 与齐王宇文宪在冀州大破齐任城王高湝，被封为定州总管，后转任亳州总管",
      },
      {
        name: "杨坚日益做大",
        start: 578,
        info: "宇文赟即位。杨坚的长女杨丽华被封为皇后，杨坚的地位和威望日益做大",
      },
      {
        name: "杨坚辅政",
        start: 579,
        info: "周宣帝病危。 刘昉、郑译伪造诏书，随国公杨坚接受遗命，辅佐朝政,平定尉迟迥之乱、司马消难之乱",
      },
    ],
  },
  {
    name: "隋",
    start: 581,
    end: 618,
    events: [
      {
        name: "静帝禅让杨坚",
        start: 581,
        info: `杨坚由隋国公晋封隋王。 北周静帝禅让杨坚. 杨坚全面复兴佛教,整顿吏治,除北周六官制，复汉魏体制，
      确立三省六部,设置粮仓、改革货币,制订《开皇律》`,
      },
      {
        name: "建都大兴城",
        start: 582,
        info: `杨坚建都城大兴城,统一度量衡`,
      },
      {
        name: "突厥愿为藩附",
        start: 584,
        info: `突厥沙钵略在西突厥和契丹东西两面威胁之下，愿意“永为藩附”`,
      },
      {
        name: "科考制度",
        start: 587,
        info: `设立分科考试制度，取代九品中正制`,
      },
      {
        name: "天下一统",
        start: 589,
        info: `陈将任忠引韩擒虎攻入建康城，捉住陈叔宝，陈朝灭亡。隋派使臣韦洸等人安抚岭南，天下一统`,
      },
      {
        name: "建仁寿宫",
        start: 593,
        info: `杨坚下诏建仁寿宫，督役严急，丁夫死者以万数`,
      },
      {
        name: "贬勇立广",
        start: 600,
        info: `杨坚晚年受诸子的困扰。太子杨勇性宽厚，率意任情，后将杨勇贬为庶，立杨广为太子`,
      },
      {
        name: "杨坚驾崩",
        start: 604,
        info: `杨坚患病，大宝殿驾崩.杨广即位,假传隋文帝遗嘱，逼迫杨勇自尽,汉王杨谅以讨杨素为名，
        在并州起兵，杨广派杨素镇压，杨谅投降，后被幽禁至死。为开掘长堑调发今山西、河南几十万农民.
        隔年营建东京,修运河，造龙舟、楼船等各种船数万艘,造显仁宫,建东都洛阳，每月役使丁男达两百万人`,
      },
      {
        name: "诛杀诸侄儿",
        start: 607,
        info: `诛杀侄儿长宁王杨俨，贬余侄儿（杨勇诸子）岭南，途中全部处死。 605-610年，被征发扰动的农民不下一千万人次，
        造成“天下死于役”的惨象`,
      },
      {
        name: "隋末农民起义",
        start: 611,
        info: `王薄率领民众在长白山起义，隋末农民起义终于爆发`,
      },
      {
        name: "征高句丽",
        start: 612,
        info: `杨广下诏征天下兵进攻高句丽`,
      },
      {
        name: "兵败辽东城",
        start: 613,
        info: `一百一十三万士兵，二百多万位民夫，败于辽东城。黎阳杨玄感起兵反隋。杨广被迫从辽东撤军。
        杨玄感败亡，杨广下令杀了三万余，三分之二被冤杀。残酷镇压农民起义，击败卢明月、张金称、高士达、刘元进，
        坑杀农民起义军。翟让瓦岗寨、窦建德、杜伏威、林仕弘等农民起义军屡次击败隋朝大军，发展壮大`,
      },
      {
        name: "三攻高句丽",
        start: 614,
        info: `杨广第三次发兵进攻高句丽，因农民起义已遍及全国，只好议和收兵`,
      },
      {
        name: "被困雁门",
        start: 617,
        info: `616年， 杨广从洛阳去江都。李密率领的瓦岗军逼围东都，并向各郡县发布檄文，历数杨广十大罪状。
        李渊在晋阳起兵，攻入长安，拥立杨侑为皇帝，遥尊杨广为太上皇`,
      },
      {
        name: "宇文化弑杨广",
        start: 618,
        info: `杨广见天下大乱，无心回北方，命修治丹阳宫。从驾纷纷逃归。虎贲郎将元礼等与直阁裴虔通共谋，
        推宇文化及为首，发动兵变，命令狐行达将其缢弑。洛阳群臣拥立杨广之孙越王杨侗为帝。宇文化及立秦王杨俊之子杨浩为皇帝。
        杨侗惧怕，派使者盖琮、马公政招降李密，李密投降，向东抵抗宇文化及。元文都与卢楚等人欲杀王世充。王世充知晓后杀卢楚，
        元文都。王世充独揽朝政大权`,
      },
      {
        name: "禅位王世充",
        start: 619,
        info: `杨侗不得已禅位于王世充，被幽禁在含凉殿后被杀`,
      },
    ],
  },
  {
    name: "唐",
    start: 618,
    end: 907,
    events: [
      {
        name: "玄武门之变",
        start: 626,
        info: "六月，李世民伏兵玄武门，杀太子建成及齐王元吉八月，李世民即位，是为唐太宗。东突厥入逼长安，唐太宗亲临渭水，与颉利可汗结便桥之盟，突厥退兵",
      },
      {
        name: "松赞干布",
        start: 629,
        info: "松赞干布即吐蕃赞普位",
      },
      {
        name: "亡东突厥",
        start: 630,
        info: "李靖俘颉利可汗，东突厥亡。日本遣唐使抵唐",
      },
      {
        name: "文成公主入吐蕃",
        start: 641,
        info: "文成公主入吐蕃，与松赞干布和亲",
      },
      {
        name: "玄奘取经还",
        start: 645,
        info: "玄奘取经还，抵长安。太宗征辽东，无功而还。铁勒九姓大首领率众降唐。《大唐西域记》成书",
      },
      {
        name: "太宗去世",
        start: 649,
        info: "五月，太宗去世。六月，太子治即位，是为唐高宗李治",
      },
      {
        name: "陈硕真起义",
        start: 653,
        info: "睦州女子陈硕真起义，自称文佳皇帝，不久，失败",
      },
      {
        name: "武则天为后",
        start: 655,
        info: "废王皇后，立武则天为皇后",
      },
      {
        name: "亡西突厥",
        start: 657,
        info: "苏定方擒阿史那贺鲁，西突厥亡。唐以其地分置崑陵、濛池二都护府，并隶安西都护",
      },
      {
        name: "破百济",
        start: 660,
        info: "苏定方破百济，擒其王",
      },
      {
        name: "吐蕃破吐谷浑",
        start: 663,
        info: "吐谷浑为吐蕃所破，其可汗诺曷钵率众内附，居于凉州",
      },
      {
        name: "灭高丽",
        start: 668,
        info: "高丽内乱，唐遣李勣等攻灭之，俘其王高藏，以其地置安东都护府",
      },
      {
        name: "义净赴天竺",
        start: 671,
        info: "义净自广州浮海赴天竺学佛学",
      },
      {
        name: "高宗去世",
        start: 683,
        info: "高宗去世，太子显即位，是为中宗，武则天执政",
      },
      {
        name: "徐敬业起兵",
        start: 684,
        info: "二月，中宗被废，弟李旦立，是为睿宗，武则天执政.九月，徐敬业于扬州起兵反武则天，三个月后兵败被杀",
      },
      {
        name: "安西四镇失守",
        start: 686,
        info: "唐军为吐蕃所败，安西四镇再度失守",
      },
      {
        name: "武则天称帝",
        start: 690,
        info: "武则天废睿宗，称帝，改国号为周",
      },
      {
        name: "夺回安西四镇",
        start: 692,
        info: "武则天遣王孝杰等大破吐蕃，夺回安西四镇",
      },
      {
        name: "摩尼教入唐",
        start: 694,
        info: "摩尼教由波斯人佛多诞传入唐",
      },
      {
        name: "契丹叛唐",
        start: 696,
        info: "契丹李尽忠与孙万荣等叛唐，陷营州，攻略河北诸州。唐诏山东近边诸州置武骑团兵，以御契丹",
      },
      {
        name: "突骑施朝唐",
        start: 699,
        info: "突骑施首领乌质勒遣子朝唐.突騎施是乌孙后裔，西突厥五咄陆部之一，西突厥被唐朝打败后，隶属五咄陆部的濛池都护继往绝可汗阿史那斛瑟罗，号为莫贺达干",
      },
      {
        name: "置武举",
        start: 702,
        info: "始置武举,分安西都护府天山以北之地为北庭都护府，治庭州，辖西突厥十姓部落",
      },
      {
        name: "武则天退位",
        start: 705,
        info: "正月，张柬之、崔玄暐等人发动政变，杀张易之、张昌宗，逼武则天退位，复立中宗李显.二月，复国号唐",
      },
      {
        name: "吐蕃会盟",
        start: 706,
        info: "唐与吐蕃首次会盟",
      },
      {
        name: "太子重俊政变",
        start: 707,
        info: "七月，太子李重俊发动政变，失败被杀",
      },
      {
        name: "金城公主和亲",
        start: 709,
        info: "金城公主和亲于吐蕃赞普弃隶蹜赞",
      },
      {
        name: "韦后临朝",
        start: 710,
        info: "六月，中宗去世，韦后临朝，立子重茂为帝。睿宗子隆基与太平公主发动政变，杀韦后及安乐公主，逼重茂逊位，拥立睿宗",
      },
      {
        name: "开元元年",
        start: 712,
        info: "八月，李隆基即位，是为唐玄宗李隆基",
      },
      {
        name: "渤海郡王",
        start: 713,
        info: "以河北诸州刺史统领团结兵,以靺鞨大祚荣所部为忽汗州，大祚荣为都督，封渤海郡王，其地始专称渤海",
      },
      {
        name: "测子午线",
        start: 725,
        info: "一行与梁令瓒制成铜铸水运浑仪。南宫说等人以一行之术实测子午线1°之长",
      },
      {
        name: "封云南王",
        start: 738,
        info: "封南诏皮罗阁为云南王，赐姓名为蒙归义",
      },
      {
        name: "天宝元年",
        start: 742,
        info: "全国兵数为五十七万四千名，边兵占四十九万",
      },
      {
        name: "回纥灭后突厥",
        start: 745,
        info: "后突厥为回纥所灭.玄宗敕改波斯（景教）寺为大秦寺",
      },
      {
        name: "高仙芝破小勃律",
        start: 747,
        info: "八月，安西四镇节度副使高仙芝破小勃律",
      },
      {
        name: "高仙芝破小勃律",
        start: 749,
        info: "诏停折冲府上下鱼书，府兵制废. 陇右节度使哥舒翰攻拔吐蕃石堡城",
      },
      {
        name: "安禄山三节度",
        start: 750,
        info: "安禄山身兼范阳、平卢、河东三节度使. 安西节度使高仙芝袭破石国.南诏背唐，附吐蕃.",
      },
      {
        name: "鉴真东渡",
        start: 753,
        info: "鉴真抵日本",
      },
      {
        name: "安史之乱",
        start: 755,
        info: "十一月，安史之乱爆发。唐诏令军事要冲置防御使。十二月，叛军陷洛阳。唐监军边令诚奉诏杀封常清、高仙芝于军中.吐蕃赞普弃松德赞即位",
      },
      {
        name: "玄宗奔蜀",
        start: 756,
        info: `正月，安禄山称帝于洛阳，国号燕。六月，叛军陷潼关。玄宗奔蜀，至马嵬驿，军士哗变，杀杨国忠，玄宗被迫缢杀杨贵妃。
        太子李亨走灵武。叛军陷长安。七月，李亨即位于灵武，是为肃宗`,
      },
      {
        name: "唐军克长安",
        start: 757,
        info: `正月，安禄山为其子安庆绪所杀。九月，唐军与回纥军克长安。十月，唐军克洛阳，安庆绪逃往邺郡`,
      },
      {
        name: "史思明占洛阳",
        start: 759,
        info: `三月，史思明增援安庆绪，败九节度使兵于邺城，旋杀庆绪，还范阳，四月，自称大燕皇帝，九月，攻占洛阳`,
      },
      {
        name: "史思明被杀",
        start: 761,
        info: `史思明为其子史朝义所杀`,
      },
      {
        name: "安史之乱结束",
        start: 763,
        info: `正月，史朝义自缢，余党降唐，安史之乱结束。十月，吐蕃攻占长安十余日，代宗奔陕州。十二月，代宗返长安，神策军扈从，入为禁军`,
      },
      {
        name: "始税青苗地头钱。吐蕃取凉州",
        start: 764,
        info: `广德二年,始税青苗地头钱。吐蕃取凉州`,
      },
      {
        name: "吐蕃取甘肃",
        start: 766,
        info: `大历元年, 吐蕃取甘州、肃州，唐河西节度使徙治凉州`,
      },
      {
        name: "吐蕃取瓜州",
        start: 776,
        info: `十一年,吐蕃取瓜州`,
      },
      {
        name: "代宗去世",
        start: 779,
        info: `五月，代宗去世，太子李适即位，是为唐德宗李适`,
      },
      {
        name: "三镇叛唐",
        start: 781,
        info: `正月，成德李惟岳、淄青李正己、魏博田悦三镇叛唐。二月，山南东道梁崇义亦叛。六月，唐以淮西节度使李希烈讨梁崇义`,
      },
      {
        name: "四王二帝之乱",
        start: 782,
        info: `四月，卢龙节度使朱滔叛。十一月，河北三镇相约称王，又邀淄青李纳称齐王。十二月，李希烈自称建兴王，联合四镇叛`,
      },
      {
        name: "平四王二帝",
        start: 786,
        info: `四月，李希烈为部将所杀，“四王二帝之乱”平`,
      },
      {
        name: "回纥改回鹘",
        start: 788,
        info: `诏定户等，规定三年一定，以为常式, 回纥改称回鹘`,
      },
      {
        name: "吐蕃攻北庭",
        start: 790,
        info: `吐蕃攻占北庭,越年攻占西州`,
      },
      {
        name: "封南诏王",
        start: 794,
        info: `异牟寻与吐蕃绝，联合唐军败吐蕃，受唐封为南诏王`,
      },
      {
        name: "宦官中尉",
        start: 796,
        info: `六月，置左右神策军护军中尉，以宦官为之`,
      },
      {
        name: "海内华夷图",
        start: 801,
        info: `贾耽绘《海内华夷图》，撰《古今郡国县道四夷述》成。杜佑撰《通典》成`,
      },
      {
        name: "日僧空海抵长安",
        start: 804,
        info: `日本学问僧空海抵长安留学`,
      },
      {
        name: "元和国计簿",
        start: 807,
        info: `李吉甫撰《元和国计簿》成，总计全国方镇四十八，州府二百九十五，县一千四百五十三，每岁国家财赋倚办止于东南八道四十四九州，一百十四万户，比天宝税户四分减三`,
      },
      {
        name: "牛李党争",
        start: 808,
        info: `牛僧孺、李宗闵等应直言极谏科，指陈时政，宰相李吉甫恶之，贬主考官，抑牛僧孺等人，启牛李党争之端`,
      },
      {
        name: "田兴归朝",
        start: 812,
        info: `魏博节度使田季安卒，军中拥立田兴，田兴归命于朝`,
      },
      {
        name: "讨淮西",
        start: 814,
        info: `淮西节度使吴少阳卒，子元济自领军务。唐发诸道兵讨之`,
      },
      {
        name: "平淮西",
        start: 817,
        info: `十月，唐邓随节度使李愬雪夜袭蔡州，擒吴元济，淮西平`,
      },
      {
        name: "平定淄青",
        start: 819,
        info: `平定淄青，成德、卢龙两镇节度使自请入朝，藩镇割据局面暂时平定`,
      },
      // {
      //   name: "三镇独立",
      //   start: 822,
      //   info: `魏博镇叛，河北三镇又恢复独立状态`,
      // },
      {
        name: "敬宗被杀",
        start: 822,
        info: `十月，敬宗为宦官刘克明等所杀，弟李昂立，是为文宗`,
      },
      {
        name: "南诏陷成都",
        start: 829,
        info: `南诏攻占成都，掠男女工匠数万而去`,
      },
      {
        name: "甘露之变",
        start: 835,
        info: `十一月，文宗与李训、郑注等谋杀宦官，失败，宦官大杀朝臣，史称甘露之变`,
      },
      {
        name: "日僧圆仁来唐",
        start: 838,
        info: `日僧圆仁来唐求法`,
      },
      {
        name: "黠戛斯灭回鹘",
        start: 840,
        info: `正月，文宗去世，弟李炎立，是为唐武宗李炎. 回鹘为黠戛斯所灭。回鹘族人被迫迁徙：其西迁葛逻禄者与邻近部落建哈剌汗国；西南迁西州、龟兹者称西州或高昌回鹘。西迁甘州者称甘州回鹘；亦有南迁附唐及迁入吐蕃者`,
      },
      {
        name: "会昌伐叛",
        start: 844,
        info: `会昌四年,平定泽潞刘稹之叛，史称会昌伐叛`,
      },
      {
        name: "会昌废佛",
        start: 845,
        info: `会昌五年, 武宗下令废佛，同时罢萨宝府、禁毁祆教、景教、摩尼教祠寺，僧徒并令还俗。史称会昌废佛`,
      },
      {
        name: "张议潮起义",
        start: 848,
        info: `张议潮率沙州人民起义，逐吐蕃守将，自摄州事，遣使上表唐朝廷`,
      },
      {
        name: "王仙芝起义",
        start: 875,
        info: `张年初，王仙芝与尚让等起义于长垣，仙芝自称“天补平均大将军兼海内诸豪都统”。五月，黄巢起义于冤句，以应仙芝`,
      },
      {
        name: "黄巢称王",
        start: 878,
        info: `二月，王仙芝战死于黄梅，尚让引余众与黄巢汇合，推黄巢为黄王，号“冲天大将军”。 是岁，义军受阻，遂挥师南下，由浙趋闽`,
      },
      {
        name: "黄巢入长安",
        start: 880,
        info: `十一月，义军克东都。十二月，僖宗与宦官田令孜等奔蜀，义军入长安，黄巢称帝，国号大齐。沙陀李克用兵逼晋阳，后为唐军所败，与其父李国昌逃入鞑靼`,
      },
      {
        name: "黄巢弃长安",
        start: 883,
        info: `四月，黄巢放弃长安东撤. 李克用任河东节度使，自此据太原。朱温任宣武节度使，自此据汴州`,
      },
      {
        name: "黄巢失败",
        start: 884,
        info: `六月，黄巢牺牲于狼虎谷，起义失败`,
      },
      {
        name: "李克用攻长安",
        start: 885,
        info: `僖宗返京。冬，李克用、王重荣攻逼长安，僖宗奔凤翔`,
      },
      {
        name: "李茂贞据凤翔",
        start: 887,
        info: ``,
      },
      {
        name: "王建占成都",
        start: 891,
        info: `王建攻占成都，据有西川`,
      },
      {
        name: "李茂贞攻长安",
        start: 896,
        info: `李茂贞攻长安，昭宗奔华州，依韩建`,
      },
      {
        name: "昭宗还长安",
        start: 898,
        info: ``,
      },
      {
        name: "朱温封梁王",
        start: 901,
        info: `二月，封朱温为梁王。冬，宰相崔胤召朱温入关，谋诛宦官，宦官劫昭宗走凤翔，依李茂贞。朱温兵围凤翔`,
      },
      {
        name: "朱温杀昭宗",
        start: 904,
        info: `正月，朱温逼迁昭宗于洛阳，八月，朱温遣人杀昭宗，立其子李柷，是为哀帝`,
      },
      {
        name: "朱温亡唐",
        start: 907,
        info: `四月，朱温逼哀帝禅让，自即帝位，改名朱晃，是为后梁太祖朱晃，改国号为梁，史称后梁，都开封。唐朝亡`,
      },
    ],
  },
  {
    name: "五代十国",
    start: 907,
    end: 979,
    events: [
      {
        name: "朱温被杀",
        start: 912,
        info: "晋败后梁蓚县之战。后梁太祖朱温被杀，其子朱友珪即位。后梁河中护国节度使朱友谦叛乱",
      },
      {
        name: "辽建国",
        start: 916,
        info: "晋败后梁莘县之战。晋败后梁太原之战。前蜀伐岐之战。耶律阿保机建立辽国",
      },
      {
        name: "杨隆演称吴王",
        start: 919,
        info: "扬州淮南节度使杨隆演即吴王位",
      },
      {
        name: "后唐灭后梁",
        start: 923,
        info: "太原河东节度使李存勖建立后唐。后唐灭后梁开封之战。后唐潞州李继珂之乱",
      },
      {
        name: "李存勖被杀",
        start: 926,
        info: "后唐魏州赵在礼叛乱。后唐庄宗李存勖被杀，明宗李嗣源即位。闽王王延翰被杀，其弟王延钧即位。辽太祖耶律阿保机去世，其子耶律德光即位",
      },
      {
        name: "后晋灭后唐",
        start: 936,
        info: "太原河东节度使石敬瑭建立后晋。后晋灭后唐洛阳之战",
      },
      {
        name: "辽灭后晋",
        start: 946,
        info: "辽灭后晋开封之战",
      },
      {
        name: "刘知远建后汉",
        start: 947,
        info: "太原河东节度使刘知远建立后汉。后汉魏州魏博节度使杜重威叛乱。辽太宗耶律德光去世，其侄耶律兀欲即位。吴越败南唐福州之战。吴越忠献王钱弘佐去世，其弟钱弘倧即位。吴越王钱弘倧被废，其弟钱弘俶即位。楚文昭王马希范去世，其弟马希广即位",
      },
      {
        name: "后周灭后汉",
        start: 951,
        info: "魏州魏博节度使郭威建立后周。太原河东节度使刘崇建立北汉。辽世宗耶律兀欲被杀，其弟耶律述律即位。后周败北汉霍邑之战。南唐灭楚潭州之战",
      },
      {
        name: "柴荣即后周",
        start: 954,
        info: "后周太祖郭威去世，其甥柴荣即位。后周败北汉高平之战。北汉世祖刘崇去世，其子刘承钧即位",
      },
      {
        name: "柴荣去世",
        start: 959,
        info: "后周伐辽之战。后周世宗柴荣去世，其子柴宗训即位",
      },
    ],
    subline: [
      { name: "五代", start: 907, end: 960 },
      { name: "十国", start: 891, end: 979 },
    ],
  },
  {
    name: "宋",
    start: 960,
    end: 1279,
    events: [
      {
        name: "陈桥兵变",
        start: 960,
        info: "赵匡胤发动陈桥兵变，称帝，国号宋。后周亡",
      },
      {
        name: "杯酒释兵权",
        start: 961,
        info: "宋太祖“杯酒释兵权”，军政大权收归中央",
      },
      {
        name: "亡南平",
        start: 963,
        info: "宋假道荆南赴湖南，南平亡",
      },
      {
        name: "亡后蜀",
        start: 965,
        info: "宋兵入成都，后蜀亡",
      },
      {
        name: "亡南汉",
        start: 971,
        info: "宋兵至广州，南汉亡",
      },
      {
        name: "亡南唐",
        start: 976,
        info: "宋军破金陵，后主李煜降，南唐亡。",
      },
      {
        name: "亡吴越",
        start: 978,
        info: "吴越王朝宋纳土，吴越亡。",
      },
      {
        name: "亡北汉",
        start: 979,
        info: "宋太宗亲征太原，北汉亡。辽大败宋兵于高梁河",
      },
      {
        name: "辽改契丹",
        start: 983,
        info: "辽改国号为大契丹。《太平御览》书成",
      },
      {
        name: "宋攻辽",
        start: 986,
        info: "宋攻辽，杨业卒于朔州",
      },
      {
        name: "澶渊之盟",
        start: 1004,
        info: "契丹大举攻宋，双方订澶渊之盟",
      },
      {
        name: "交子纸币",
        start: 1023,
        info: "交子在四川地区发行，是世界上最早的纸币",
      },
      {
        name: "党项西夏",
        start: 1028,
        info: "党项首领元昊（见西夏景宗李元昊）称帝，建都兴庆，国号大夏，史称西夏",
      },
      {
        name: "宋夏议和",
        start: 1043,
        info: "宋、夏议和成，宋册元昊为夏国主。宋范仲淹实行变法，旋罢",
      },
      {
        name: "泉州洛阳桥",
        start: 1059,
        info: "泉州建成中国第一座海港大石桥洛阳桥",
      },
      {
        name: "王安石变法",
        start: 1069,
        info: "王安石（1021～1086）开始实行变法",
      },
      {
        name: "资治通鉴书成",
        start: 1084,
        info: "司马光《资治通鉴》书成，为中国第一部编年体通史",
      },
      {
        name: "废王安石新法",
        start: 1085,
        info: "司马光执政，废王安石新法",
      },
      {
        name: "秦观著蚕书",
        start: 1090,
        info: "秦观著《蚕书》出版，为中国最早养蚕专著",
      },
      {
        name: "李诫营造法式",
        start: 1100,
        info: "李诫著《营造法式》成书，为世界最早的建筑手册",
      },
      {
        name: "蔡京任相",
        start: 1102,
        info: "宋徽宗任蔡京为相，定“元祐奸党”，禁“元祐学术”，立“元祐党人碑”",
      },
      {
        name: "女真大金",
        start: 1115,
        info: "女真首领阿骨打在会宁称帝，国号大金",
      },
      {
        name: "指南针航海",
        start: 1119,
        info: "宋朱彧《萍洲可谈》记载指南针应用于航海。金颁行女真文字",
      },
      {
        name: "方腊起义",
        start: 1120,
        info: "睦州青溪方腊起义",
      },
      {
        name: "金亡辽",
        start: 1125,
        info: "金兵于应州俘辽天祚帝，辽亡。金大举攻宋。宋徽宗禅位太子桓，是为钦宗",
      },
      {
        name: "金亡北宋",
        start: 1127,
        info: "年金攻陷东京，俘徽、钦二帝，北宋亡。金立张邦昌为楚帝，都金陵。宋康王赵构在南京（今商丘）即位，是为高宗，南宋建立",
      },
      {
        name: "金兵渡长江",
        start: 1129,
        info: "宋高宗自扬州逃杭州；金兵渡长江，追高宗至海上",
      },
      {
        name: "秦桧归宋",
        start: 1130,
        info: "金立宋降臣刘豫为大齐皇帝，纵秦桧归宋。洞庭湖滨钟相起义，旋败，杨么继之",
      },
      {
        name: "陈规用火枪",
        start: 1132,
        info: "宋陈规守德安时，用“火枪”作战，为世界最早的管形火器",
      },
      {
        name: "刘豫刻石",
        start: 1136,
        info: "刘豫刻石《华夷图》、《禹迹图》，为世界最古老的地图印版",
      },
      {
        name: "宋金和议",
        start: 1139,
        info: "宋金和议成。金归宋河南、陕西地",
      },
      {
        name: "岳军郾城破金军",
        start: 1140,
        info: "金毁约复取河南、陕西地。岳家军在郾城大破金军。宋高宗听秦桧言，强令岳飞班师",
      },
      {
        name: "宋廷罢岳飞",
        start: 1141,
        info: "宋廷罢岳飞、张俊、韩世忠兵权。宋金和议",
      },
      {
        name: "高宗称臣",
        start: 1142,
        info: "宋金划分地界，高宗以“臣构”名义上誓表，金册康王为宋帝",
      },
      {
        name: "金背约攻宋",
        start: 1161,
        info: "金背约大举攻宋。宋将李宝在胶西陈家岛用火箭火炮歼金水师。宋虞允文大败金师于采石，使用了“霹雳炮”",
      },
      {
        name: "宋称侄皇帝",
        start: 1164,
        info: "宋金和议成。宋称侄皇帝，割海、泗、唐、邓、商、秦等地与金、岁贡金银20万两、绢20万匹",
      },
      {
        name: "韩侂胄弄权",
        start: 1195,
        info: "宰相赵汝愚等被贬，韩侂胄弄权，开庆元党禁",
      },
      {
        name: "杨忠辅统天历",
        start: 1199,
        info: "杨忠辅创《统天历》，定回归年为365.2425日，与当代公历平均历年长度相等",
      },
      {
        name: "蒙古建国",
        start: 1206,
        info: "铁木真建蒙古国，称成吉思汗",
      },
      {
        name: "宋金订伯侄国",
        start: 1208,
        info: "宋金重订和约，世为伯侄之国，增岁币，函韩侂胄首赎淮南地",
      },
      {
        name: "蒙金战争",
        start: 1211,
        info: "成吉思汗攻金，蒙金战争开始",
      },
      {
        name: "金宣宗南迁",
        start: 1214,
        info: "金迁都南京（开封），史称“宣宗南迁”",
      },
      {
        name: "蒙古下金北京",
        start: 1215,
        info: "蒙古军攻下金北京、中都（今北京）",
      },
      {
        name: "金军攻宋",
        start: 1217,
        info: "金军攻宋，自此宋金连年争战",
      },
      // {
      //   name: "蒙古灭西夏",
      //   start: 1227,
      //   info: "",
      // },
      {
        name: "蒙宋灭金",
        start: 1234,
        info: "蒙古与宋攻破蔡州，金亡",
      },
      {
        name: "忽必烈亡大理",
        start: 1254,
        info: "忽必烈攻入云南大理城，大理国亡",
      },
      // {
      //   name: "蒙哥汗攻四川",
      //   start: 1259,
      //   info: "蒙哥汗围攻四川合州钓鱼城，卒于军中。宋寿春府制成突火枪，为人类最早用火药发射子弹的管状火器",
      // },
    ],
  },
  {
    name: "元",
    start: 1271,
    end: 1368,
    events: [
      {
        name: "蒙古西征",
        start: 1223,
        info: "蒙古第一次西征1223年（蒙古太祖18年）成吉思汗西征结束东返。蒙古第一次西征结束",
      },
      {
        name: "成吉思汗卒",
        start: 1227,
        info: "蒙古灭西夏,蒙古太祖21年,成吉思汗病卒。幼子拖雷监国，蒙古灭西夏",
      },
      // {
      //   name: "蒙古灭金",
      //   start: 1234,
      //   info: "蒙古太宗6年,蒙古灭金",
      // },
      {
        name: "忽必烈即位",
        start: 1259,
        info: "蒙哥亲征南宋, 死于四川军中. 1260年（元世祖中统元年）忽必烈即汗位于开平",
      },
      {
        name: "创蒙古新字",
        start: 1269,
        info: "正式下诏伐南宋襄阳（元世祖至元6年）创蒙古新字",
      },
      {
        name: "国号大元",
        start: 1271,
        info: "始定国号为大元",
      },
      {
        name: "元大都建成",
        start: 1272,
        info: "元世祖至元9年,大都建成。上都成为陪都",
      },
      {
        name: "下樊城襄阳",
        start: 1273,
        info: "元世祖至元10年,元军攻下樊城、襄阳",
      },
      {
        name: "下临安",
        start: 1276,
        info: "元世祖至元13年,元军攻下南宋临安",
      },
      {
        name: "败宋崖山",
        start: 1279,
        info: "元军大败大宋余部于崖山，南宋残余势力消灭",
      },
      {
        name: "郭守敬授时历",
        start: 1280,
        info: "元世祖至元17年,郭守敬等修成《授时历》",
      },
      {
        name: "远征日本",
        start: 1281,
        info: "元世祖至元18年, 发兵远征日本，遇台风，几乎全军覆没",
      },
      {
        name: "攻安南",
        start: 1284,
        info: "镇南王脱欢攻安南，占城，次年败还",
      },
      {
        name: "复征安南",
        start: 1287,
        info: "东北宗王造反，败死，欢脱复征安南，仍不利而还",
      },
      {
        name: "马可波罗返欧",
        start: 1291,
        info: "颁行行政法规《至元新格》意大利旅行家马可波罗经海盗返回欧洲",
      },
      {
        name: "忽必烈病逝",
        start: 1294,
        info: "铁穆耳即位。罗马教廷派遣传教士孟特戈维诺抵达大都传教",
      },
      {
        name: "大元大一统志",
        start: 1303,
        info: "《大元大一统志》修成",
      },
      {
        name: "蔡五九起事",
        start: 1315,
        info: "江西蔡五九聚众起事，败死",
      },
      {
        name: "英宗遇刺",
        start: 1323,
        info: "颁行《大元通制》英宗遇刺。泰定帝也孙铁木儿即位",
      },
      {
        name: "弥勒佛有天下",
        start: 1325,
        info: "河南息州赵丑厮，郭菩萨倡言“弥勒佛当有天下”被杀",
      },
      {
        name: "泰定卒",
        start: 1328,
        info: "文宗天历元年元泰定卒于上郡，大臣燕铁木儿在大都发动政变，拥立文宗即位",
      },
      {
        name: "经世大典",
        start: 1331,
        info: "征书《经世大典》修成",
      },
      {
        name: "使罗马教廷",
        start: 1336,
        info: "遣使团出使罗马教廷",
      },
      {
        name: "罗马教廷遣使",
        start: 1342,
        info: "罗马教廷使节马丽诺丽一行抵达上都",
      },
      {
        name: "白莲教起事",
        start: 1351,
        info: "发民工修黄河，白莲教徒刘福通起事，攻克颍州，徐寿辉起兵于锦水.",
      },
      {
        name: "郭子兴起兵",
        start: 1352,
        info: "郭子兴起兵于濠州",
      },
      {
        name: "张士诚起兵",
        start: 1353,
        info: "张士诚起兵于淮东",
      },
      {
        name: "朱元璋兴起",
        start: 1355,
        info: "刘福通立韩林儿为帝国号宋，年号龙凤。郭子兴死，朱元璋继统其众",
      },
      {
        name: "朱元璋占集庆",
        start: 1356,
        info: "朱元璋攻占集庆为根据地。刘福通兵发三路北伐",
      },
      {
        name: "刘福通克梁成",
        start: 1358,
        info: "刘福通攻克梁成",
      },
      {
        name: "大战鄱阳湖",
        start: 1363,
        info: "陈友谅与朱元璋大战于鄱阳湖，陈友谅败死",
      },
      {
        name: "朱元璋克徐州",
        start: 1367,
        info: "朱元璋攻克徐州，俘虏张士诚，命令常遇春，徐达统军北伐",
      },
    ],
  },
  {
    name: "明",
    start: 1368,
    end: 1644,
    events: [
      {
        name: "朱元璋称王",
        start: 1364,
        info: "朱元璋称吴王，建立西吴",
      },
      {
        name: "朱元璋称帝",
        start: 1368,
        info: `正月，朱元璋在应天府即帝位，国号明，是为明太祖朱元璋，闰七月，元顺帝逃往上都，史称北元。八月，明军占领大都，元亡。
        明定田赋额，编定役法，定卫所制度`,
      },
      {
        name: "徐达破北",
        start: 1370,
        info: `四月，徐达破元将扩廓帖木儿，元顺帝病死于应昌，昭宗继位. 分封诸王。诏定科举制度`,
      },
      {
        name: "颁大明律",
        start: 1374,
        info: `定屯田法。颁《大明律》. 罢市舶司。严海禁`,
      },
      {
        name: "胡惟庸案",
        start: 1380,
        info: `胡惟庸案发，左丞相胡惟庸以谋反罪被杀，株连三万余人. 罢中书省，废丞相制度。改大都督府为五军都督府。罢御史台，废御史大夫`,
      },
      {
        name: "徐达出塞击元",
        start: 1381,
        info: `徐达等出塞击元，俘获甚众. 是年，定赋役籍，编里甲，造黄册`,
      },
      {
        name: "沐英守云南",
        start: 1383,
        info: `遣西平侯沐英镇守云南，从此沐氏世守其地`,
      },
      {
        name: "郭桓案",
        start: 1385,
        info: `三月，郭桓案发，郭下狱死。株连者数万人`,
      },
      {
        name: "北元主远走",
        start: 1388,
        info: `明军至捕鱼儿海，俘元皇子及妃嫔等数万人，北元主远走`,
      },
      {
        name: "蓝玉案",
        start: 1393,
        info: `蓝玉案发，凉国公蓝玉因谋反被杀，株连死者一万五千余人`,
      },
      {
        name: "南北榜",
        start: 1397,
        info: `南北榜案发，开明朝取士分南北之先例`,
      },
      {
        name: "太祖死",
        start: 1398,
        info: `闰五月，太祖死，皇太孙允炆即位，是为建文帝。即位后议定削藩，削废周、齐、湘、代、岷五王`,
      },
      {
        name: "靖难之役",
        start: 1399,
        info: `靖难之役起，七月，燕王朱棣起兵北平`,
      },
      {
        name: "朱棣即帝位",
        start: 1402,
        info: `六月，燕兵渡江，攻入南京。宫中起火，建文帝不知所终。燕王朱棣即帝位，是为明成祖朱棣`,
      },
      {
        name: "郑和下西洋",
        start: 1405,
        info: "1405年-1433年 命宦官郑和与王景弘等使南洋各地，郑和下西洋自此始. 七次下西洋",
      },
      {
        name: "永乐大典",
        start: 1407,
        info: "《永乐大典》成书，凡二万二千九百三十七卷，一万一千零九十五册. 改安南置交阯布政使司",
      },
      {
        name: "黄教坐大",
        start: 1409,
        info: "置奴儿干都司. 是年，乌斯藏黄教(格鲁派)创始人宗喀巴在拉萨行大祈愿法会，黄教渐成执政教派",
      },
      {
        name: "成祖击瓦剌",
        start: 1414,
        info: "成祖亲领步骑五十万击瓦剌马哈木，大破之",
      },
      {
        name: "刘江破倭",
        start: 1419,
        info: "辽东总兵刘江大破倭寇于金州望海埚",
      },
      {
        name: "迁都北京",
        start: 1421,
        info: "迁都北京，以南京为留都",
      },
      {
        name: "成祖病死",
        start: 1424,
        info: "成祖第五次率师亲征鞑靼。七月还至榆木川时病死。皇太子高炽即位，是为仁宗",
      },
      {
        name: "设钞关",
        start: 1429,
        info: "始设钞关，以船只大小收税，称“船料”",
      },
      {
        name: "郑和还自西洋",
        start: 1433,
        info: "郑和第七次自西洋还。郑和下西洋前后二十八年，经三十余国",
      },
      {
        name: "郑和还自西洋",
        start: 1433,
        info: "郑和第七次自西洋还。郑和下西洋前后二十八年，经三十余国",
      },
      {
        name: "宣宗死",
        start: 1435,
        info: "正月，宣宗死，太子祁镇即位，是为英宗.以宦官王振掌司礼监，明代宦官乱政由此开始",
      },
      {
        name: "征麓川",
        start: 1441,
        info: "明军出征麓川，宣慰使思任发败逃",
      },
      {
        name: "叶宗留起义",
        start: 1445,
        info: "叶宗留起义。处州人叶宗留聚众至福建开矿，被禁，遂杀官反抗",
      },
      {
        name: "叶宗留称大王",
        start: 1447,
        info: "叶宗留聚众数万起义，称大王，攻建阳、建宁等地",
      },
      {
        name: "土木堡之变",
        start: 1449,
        info: "正统14年。瓦剌也先犯大同，7月，英宗率军亲征，8月在土木堡英宗被俘，明军全军覆没",
      },
      {
        name: "英宗回京",
        start: 1450,
        info: "景泰元年，瓦剌部释放朱祁镇回京，后被朱祁钰囚禁在西苑",
      },
      {
        name: "夺门之变",
        start: 1457,
        info: `景泰八年，夺门之变。正月，宦官曹吉祥及其党羽石亨趁景帝病危，迎太上皇英宗复位. 朱祁钰病逝，享年29岁，葬于北京西山景泰陵。
        庙号代宗，在位年间，重用大臣于谦等人。治理国政颇为有序. 天顺元年，于谦被英宗朱祁镇斩杀于崇文门外，享年59岁`,
      },
      {
        name: "鞑靼南下",
        start: 1460,
        info: "天顺四年，鞑靼率军分路南下，京师大乱",
      },
      {
        name: "朱祁镇逝世",
        start: 1464,
        info: "自明朝开国以来的殉葬制度宣告终结",
      },
      {
        name: "剿建州女真",
        start: 1467,
        info: "成化三年，犁庭扫穴。朱见深下令进剿建州女真，捣其巢穴，绝其种类",
      },
      {
        name: "苗民起义",
        start: 1476,
        info: "四川播州苗民起义",
      },
      {
        name: "宪宗逝世",
        start: 1487,
        info: "成化23年，朱见深逝世，享年40岁，葬于明十三陵之茂陵，庙号宪宗。成化时代风气清明，宽免赋税，减省刑罚，不失为一代明君",
      },
      {
        name: "刘六刘七起义",
        start: 1510,
        info: "正德五年，刘六刘七起义，为明中叶规模最大的一次起义",
      },
      {
        name: "應州之战",
        start: 1519,
        info: "正德14年，應州之战朱厚照亲征，大败小王子",
      },
      {
        name: "大礼议事件",
        start: 1524,
        info: "嘉靖三年，大礼议事件爆发，群臣力争，下狱者100数十人",
      },
      {
        name: "蒙古进犯",
        start: 1540,
        info: "公元1540年，公元1542年, 蒙古俺達进犯",
      },
      {
        name: "壬寅宫变",
        start: 1542,
        info: "嘉靖21年，婢杨金英谋杀世宗未遂。吐鲁番向明朝进贡，设岷州",
      },
      {
        name: "筑大同长城",
        start: 1546,
        info: "嘉靖25年，修筑大同长城",
      },
      {
        name: "庚戌之变",
        start: 1550,
        info: "嘉靖9年。俺答攻宣府，至通州，逼京师。庚戌之变",
      },
      {
        name: "葡占澳门",
        start: 1553,
        info: "葡萄牙攫取澳门居住权",
      },
      {
        name: "戚继光破倭",
        start: 1563,
        info: "嘉靖42年，巡抚谭纶率戚继光、俞大猷、刘显三将大破倭寇，收复兴化，浙、闽倭寇渐平",
      },
      {
        name: "解除海禁",
        start: 1567,
        info: "隆庆元年，张居正入阁, 解除海禁。明朝出现一个全面的开放局面 （隆庆开关）",
      },
      {
        name: "俺答犯大同",
        start: 1569,
        info: "隆庆三年，俺答进犯大同右衙。戚继光任总兵官，镇守薊州等地",
      },
      {
        name: "隆庆和议",
        start: 1571,
        info: "隆庆五年，隆庆和议，封俺答为顺义王，开互市",
      },
      {
        name: "张居正改革",
        start: 1573,
        info: "万历元年，张居正请行“考成法”，以整顿吏治",
      },
      {
        name: "本草纲目",
        start: 1578,
        info: "万历六年，《本草纲目》问世。本草著作52卷，三易其稿",
      },
      {
        name: "赋役改革",
        start: 1581,
        info: "万历九年，一条鞭法，享张居正进行赋役制度改革，扭转财政危机",
      },
      {
        name: "宁夏朝鲜之役",
        start: 1592,
        info: "宁夏之役起,朝鲜之役起。 5月，日本侵朝鲜。明兵赴援，大败",
      },
      {
        name: "平壤大捷",
        start: 1593,
        info: "万历21年，平壤大捷。李如松收复平壤，开城，进攻王京，日军弃王京，退居釜山，明撤主力回国",
      },
      {
        name: "平壤大捷",
        start: 1597,
        info: "万历25年，日本再侵朝鲜",
      },
      {
        name: "播州之役",
        start: 1600,
        info: "万历28年，播州之役， 播州杨应龙作乱多年，明军评乱",
      },
      {
        name: "楚宗之乱",
        start: 1604,
        info: "万历32年，楚宗之乱。第二次妖书案与伪楚王案、劫杠案案共称“楚宗之乱”",
      },
      {
        name: "几何原本",
        start: 1607,
        info: "万历35年，徐光启译《几何原本》",
      },
      {
        name: "明末三大案",
        start: 1615,
        info: "万历43年，明末三大案之一，杀张差结案",
      },
      {
        name: "后金立",
        start: 1616,
        info: "努尔哈赤建立后金",
      },
      {
        name: "萨尔浒之战",
        start: 1619,
        info: "",
      },
      {
        name: "后金陷沈阳",
        start: 1621,
        info: "天启元年。后金攻陷沈阳",
      },
      {
        name: "荷兰侵台湾",
        start: 1622,
        info: "天启二年，荷兰殖民者入侵台湾",
      },
      {
        name: "苏州民变",
        start: 1626,
        info: "苏州居民因反对滥捕东林党人，发生民变。后颜佩韦，杨念如等五人挺身投案被杀。葬于虎丘，称五人墓",
      },
      {
        name: "袁崇焕退后金",
        start: 1627,
        info: "苏天启七年，皇太极攻宁远，锦州被袁崇焕击退",
      },
      {
        name: "李自成起义",
        start: 1629,
        info: "",
      },
      {
        name: "袁崇焕被凌迟",
        start: 1630,
        info: "1629年，毛文龙被袁崇焕斩杀,杨镐被明廷斩杀.满桂战死，袁崇焕下狱.1630年，袁崇焕被凌迟",
      },
      {
        name: "义军入豫",
        start: 1633,
        info: "高迎祥，李自成，张献忠等渡黄河南下入豫",
      },
      {
        name: "义军破凤阳",
        start: 1635,
        info: "高迎祥，张献忠东进 破凤阳，张献忠率部入陕西",
      },
      {
        name: "后金改清",
        start: 1636,
        info: "后金改国号为清",
      },
      {
        name: "天工开物",
        start: 1637,
        info: "《天工开物》问世，宋应星所作，共三卷十八篇，是中国17世纪的工艺百科全书",
      },
      {
        name: "李自成入洛阳",
        start: 1641,
        info: "",
      },
      {
        name: "李自成亡明",
        start: 1644,
        info: "李自成建立大顺政权，农民军攻占北京，明亡",
      },
    ],
  },
  {
    name: "清",
    start: 1644,
    end: 1912,
    events: [
      {
        name: "清兵屠扬州",
        start: 1645,
        info: "清兵屠扬州，史可法殉难。福王政权灭亡，李自成死于湖北通山，南明鲁王监国绍兴。南明唐王称帝于福州，年号隆武。清兵屠嘉定。江阴绅民据城抗",
      },
      {
        name: "张献忠战死",
        start: 1646,
        info: "张献忠抵御清兵在凤凰山中箭而死，南明桂王在肇庆称帝，建元永历，清朝严格实行逃人法。南明唐王在广州称帝，建元昭武",
      },
      {
        name: "郭怀一抗殖民",
        start: 1652,
        info: "郭怀一领导台湾人民反抗殖民统治",
      },
      {
        name: "郑成功北伐",
        start: 1659,
        info: "郑成功于张煌言联合北伐江南，“通海案”由此而起",
      },
      {
        name: "收复台湾",
        start: 1661,
        info: "康熙即位，四大臣辅政。江南奏销案起，郑成功驱逐尼德兰殖民者，收复台湾，苏州发生哭庙案，杀金圣叹等",
      },
      {
        name: "南明覆灭",
        start: 1662,
        info: "平西王吴三桂在缅甸吊死永历，南明覆灭",
      },
      {
        name: "捕鳌拜",
        start: 1669,
        info: "《大统历》误罢杨光先，南怀仁掌管钦天差。逮捕大臣鳌拜，诏永停圈地，实行更名田制度，禁止传播天主教",
      },
      {
        name: "三藩叛乱",
        start: 1673,
        info: "三藩叛乱开始",
      },
      {
        name: "察哈尔举兵",
        start: 1675,
        info: "内蒙察哈尔举兵造反",
      },
      {
        name: "三藩之乱结束",
        start: 1681,
      },
      {
        name: "清设台湾府",
        start: 1684,
        info: "郑可爽投降，统一台湾，设置台湾府。诏弛海禁。康熙第一次南巡",
      },
      {
        name: "雅克萨之战",
        start: 1686,
        info: "1685年至1686年，清军与俄军两度雅克萨之战，清军大捷。，设立粤海关，英国人在广州设立商馆，中英通商",
      },
      {
        name: "尼布楚条约",
        start: 1689,
        info: "康熙第二次南巡，中俄签订《尼布楚条约》",
      },
      {
        name: "多伦会盟",
        start: 1691,
      },
      {
        name: "中俄北京互市",
        start: 1693,
        info: "俄罗斯派特使抵达北京，中俄在北京互市",
      },
      {
        name: "昭莫多之战",
        start: 1696,
        info: "昭莫多之战，准噶尔噶尔丹败",
      },
      {
        name: "康熙三巡南",
        start: 1699,
        info: "1697年康熙第三次亲征噶尔丹，噶尔丹死，侄子策妄阿拉布坦即汗位.1699年康熙第三次南巡",
      },
      {
        name: "全唐诗成",
        start: 1703,
        info: "索尔图以结党乱国被拘禁，《全唐诗》编成。承德修热河行宫",
      },
      {
        name: "康熙五巡南",
        start: 1705,
        info: "康熙第五次南巡，罗马教皇遣使抵达北京",
      },
      {
        name: "康熙六巡南",
        start: 1707,
        info: "1708年废太子",
      },
      {
        name: "戴名世见杀",
        start: 1711,
        info: "戴名世以《南山集》获罪被杀",
      },
      {
        name: "封班禅",
        start: 1713,
        info: "清廷封班禅为班禅额尔德尼",
      },
      {
        name: "康熙字典",
        start: 1716,
        info: "《康熙字典》完成",
      },
      {
        name: "护送达赖六世",
        start: 1719,
        info: "清军逐出准噶尔军出藏，护送达赖六世",
      },
      {
        name: "台湾朱一贵起义",
        start: 1721,
      },
      {
        name: "秘密立储",
        start: 1723,
        info: "青海罗不藏丹津叛乱，实行秘密立储，废除陕西山西坊乐籍，削除绍兴堕民籍",
      },
      {
        name: "年庚绕获罪",
        start: 1725,
        info: "年庚绕，隆科多获罪，汪景棋《西征随笔》案起，《古今图案集成》竣",
      },
      {
        name: "恰克图条约",
        start: 1728,
        info: "中俄《恰克图条约》，西藏阿尔布巴事件平定",
      },
      {
        name: "败准噶尔",
        start: 1731,
        info: "北路军清军在和通泊惨败准噶尔",
      },
      {
        name: "苗民起义",
        start: 1735,
        info: "贵州苗民起义。雍正崩，乾隆即位",
      },
      {
        name: "红溪惨案",
        start: 1740,
        info: "尼德兰屠杀爪哇华侨，造成“红溪惨案”",
      },
      {
        name: "瞻对战役",
        start: 1745,
        info: "乾隆帝派兵平定四川上下瞻对",
      },
      {
        name: "金川战役",
        start: 1747,
        info: "清平大小金川之战是乾隆朝平定四川大小金川叛乱，维护西南边疆稳定的两次大规模战役",
      },
      {
        name: "平西藏叛乱",
        start: 1750,
        info: "1751年乾隆第一次南巡，废除西藏藏王制度，创建噶厦制度",
      },
      {
        name: "平西藏叛乱",
        start: 1750,
        info: "1751年乾隆第一次南巡，废除西藏藏王制度，创建噶厦制度",
      },
      {
        name: "封阿穆尔亲王",
        start: 1754,
        info: "准噶尔部阿穆尔率部投降，诏封亲王，命整军征服准噶尔",
      },
      {
        name: "兆惠入伊利",
        start: 1757,
        info: "兆惠将军入伊利，再定准格尔，阿穆尔准噶尔逃入俄国，死。乾隆第二次南巡，拒绝英国人赴浙江贸易之请，限定广州单口通商，在西藏设立摄政制度",
      },
      {
        name: "喀什设办事处",
        start: 1759,
        info: "平定大小和卓叛乱，于喀什噶尔设立办事处，领队大臣，英国洪仁辉赴天津控告行商欠银",
      },
      {
        name: "人口破2亿",
        start: 1762,
        info: "乾隆第三次南巡，设伊利将军统辖天山南北两路，人口首次突破2亿人",
      },
      {
        name: "乾隆四巡南",
        start: 1765,
        info: "乾隆第四次南巡。回部民变",
      },
      {
        name: "二次金川战役",
        start: 1771,
        info: "渥巴锡率领土尔扈特部由俄罗斯伏尔加河下游返回祖国，第二次金川战役爆发",
      },
      {
        name: "金川战役结束",
        start: 1776,
      },
      {
        name: "乾隆五巡南",
        start: 1780,
        info: "乾隆第五次南巡，六世班禅赴热河觐见乾隆帝，在北京圆寂",
      },
      {
        name: "乾隆六巡南",
        start: 1784,
        info: "乾隆第六次南巡，甘肃回教田五反清，美国商船“中国皇后号”抵达广州",
      },
      {
        name: "安南战役",
        start: 1788,
        info: "清军出兵镇南关，安南战役开始",
      },
      {
        name: "徽班进京",
        start: 1790,
        info: "四大徽班进京",
      },
      {
        name: "中英通使",
        start: 1793,
        info: "颁布《钦定藏内善后章程》。英使马戈尔尼，中英首次正式通使",
      },
      {
        name: "白莲教起义",
        start: 1796,
        info: "五省白莲教大起义",
      },
      {
        name: "嘉庆亲政",
        start: 1799,
        info: "乾隆死，和珅死",
      },
      {
        name: "白莲教起义失败",
        start: 1804,
      },
      {
        name: "蔡牵沉海",
        start: 1809,
        info: "蔡牵为清军所败，自沉于海",
      },
      {
        name: "英使来华",
        start: 1816,
        info: "英国使者来华，因礼仪之争，未能获得觐见嘉庆帝",
      },
      {
        name: "张格尔叛乱",
        start: 1820,
        info: "道光即位，张格尔叛乱",
      },
      {
        name: "海运漕粮",
        start: 1826,
        info: "江苏施行海运漕粮成功",
      },
      {
        name: "浩罕入侵",
        start: 1830,
        info: "浩罕入侵，陶树废除“纲盐”，实行行票盐法",
      },
      {
        name: "赵金龙起义",
        start: 1833,
        info: "赵金龙领导三湘瑶族民族起义",
      },
      {
        name: "虎门销烟",
        start: 1839,
        info: "林则徐虎门销烟",
      },
      {
        name: "第一次鸦片战争",
        start: 1840,
        info: "1840-1842年，第一次鸦片战争，中国开始沦为半殖民地半封建社会",
      },
      {
        name: "南京条约",
        start: 1842,
        info: "第一个不平等条约-中英《南京条约》签订，英占香港岛，开放五口通商",
      },
      {
        name: "虎门条约",
        start: 1843,
        info: "中英《虎门条约》签订,同年，洪秀全创立拜上帝会",
      },
      {
        name: "中美中法条约",
        start: 1844,
        info: "中美《望厦条约》和中法《黄埔条约》签订",
      },
      {
        name: "太平天国",
        start: 1851,
        info: "清朝人口达43610万。同年，拜上帝会在广西金田村起事，建号太平天国.",
      },
      {
        name: "太平军入南京",
        start: 1853,
        info: "太平军攻入南京，改名天京，定为国都；并颁《天朝田亩制度》",
      },
      {
        name: "第二次鸦片战争",
        start: 1856,
        info: "1856-1860年，第二次鸦片战争.英法联军侵华。同年，天京事变。太平天国内讧，渐趋败亡",
      },
      {
        name: "天津条约",
        start: 1858,
        info: "英法联军攻陷大沽，清廷与两国签订《天津条约》，又与俄签订《瑷珲条约》",
      },
      {
        name: "资政新篇",
        start: 1859,
        info: "英法联军再次入侵中国. 提出在中国发展资本主义方案的第一人：洪仁玕《资政新篇》",
      },
      {
        name: "北京条约",
        start: 1860,
        info: "英法联军火烧圆明园；攻陷北京。中英、中法、中俄分别签订《北京条约》",
      },
      {
        name: "太平天国败亡",
        start: 1864,
        info: "洪秀全病死，清军攻入南京。同年，中俄签订《勘分西北界约记》",
      },
      {
        name: "同治帝病死",
        start: 1875,
        info: "同治皇帝载淳病死。慈禧太后召集群臣会议，决定以醇亲王奕儇之子载湉即帝位，改明年为光绪元年。李鸿章与英使威妥玛签订《烟台条约》。中俄签订《伊犁条约》。翁同龢入军机处",
      },
      {
        name: "中法战争",
        start: 1883,
        info: "1883-1885年，李鸿章与法国代表福禄诺签订《法越简明条约》。清政府对法宣战，中法战争正式爆发",
      },
      {
        name: "法占镇南关",
        start: 1885,
        info: "法军攻陷谅山。法军侵占中国镇南关。李鸿章与法使巴德诺签订中法《会订越南条约》",
      },
      {
        name: "建北洋水师",
        start: 1888,
        info: "清廷建立北洋水师，加强军备，巩固海疆",
      },
      {
        name: "甲午战争",
        start: 1894,
        info: "中日甲午战争（1894—1895年）爆发。同年，孙中山在檀香山创立兴中会",
      },
      {
        name: "马关条约",
        start: 1895,
        info: "中日签订《马关条约》，割让台湾及辽东半岛。俄法德三国干涉还辽。同年，洋务运动宣告终结",
      },
      {
        name: "中俄密约",
        start: 1896,
        info: "签订《中俄密约》。订立中东铁路合同。德国舰队强占胶州湾。俄国舰队强占旅顺和大连湾",
      },
      {
        name: "戊戌变法",
        start: 1898,
        info: "德国强迫清政府订立《胶澳租界条约》。中俄签订《旅大租地条约》。中英签订沪宁铁路合同。中英签订《展拓香港界址专约》。中英签订《威海卫租界条约》。光绪帝拟就给康有为和杨锐的密诏。谭嗣同等“戊戌六君子”被杀",
      },
      {
        name: "义和团",
        start: 1899,
        info: "1义和团兴起，在山东各地杀教士、教民。同年，康有为、梁启超在日本成立保皇会",
      },
      {
        name: "八国联军侵华",
        start: 1900,
        info: "6月21日，清政府宣布对英美等八国同时宣战。8月16日，八国联军攻陷北京，慈禧太后挟光绪帝离京出逃。同年，兴中会惠州起义失败",
      },
      {
        name: "辛丑条约",
        start: 1901,
        info: "清政府与西方列强十一国签订《辛丑条约》。清廷下令筹划新政",
      },
      {
        name: "交收东三省条约",
        start: 1902,
        info: "中俄签订《交收东三省条约》",
      },
      {
        name: "中国同盟会",
        start: 1905,
        info: "清政府罢科举，派五大臣出洋考察宪政。同年，孙中山创立中国同盟会，提出三民主义",
      },
      {
        name: "预备立宪",
        start: 1906,
        info: "清政府宣布“预备立宪”",
      },
      {
        name: "同盟会起事",
        start: 1907,
        info: "1907年至1908年，同盟会发动六次起事均失败",
      },
      {
        name: "光绪慈禧死",
        start: 1908,
        info: "光绪帝、慈禧太后先后驾崩；宣统帝即位",
      },
      {
        name: "辛亥革命",
        start: 1911,
        info: "4月黄花岗起事未成；5月清政府宣布铁路国有，引起保路风潮；10月武昌起义，南方各省纷纷宣布独立，史称辛亥革命",
      },
      {
        name: "清帝退位",
        start: 1912,
        info: "1月1日，中华民国宣布成立。2月12日，宣统帝溥仪宣布退位，清朝统治被推翻",
      },
    ],
  },
  {
    name: "中华民国",
    start: 1912,
    events: [
      {
        name: "二次革命",
        start: 1913,
        info: "袁世凯镇压二次革命，同年当选为首任中华民国大总统",
      },
      { name: "中华民国约法", start: 1914 },
      { name: "新文化运动", start: 1915 },
      {
        name: "袁世凯称帝",
        start: 1916,
        info: "袁世凯恢复帝制失败. 1915年12月宣布自称皇帝，改国号为中华帝国，建元洪宪，史称“洪宪帝制”。此举遭到各方反对，引发护国运动，袁世凯不得不在做了83天皇帝之后宣布取消帝制.1916年6月6日因尿毒症不治而亡，归葬于河南安阳",
      },
      {
        name: "五四运动",
        start: 1919,
        info: "新文化运动兴起的标志：陈独秀在上海创办《新青年》;中国新民主主义革命开始的标志：五四运动",
      },
      {
        name: "上海共产主义小组",
        start: 1920,
        info: "中国第一个共产主义小组：上海共产主义小组",
      },
      { name: "共产党成立", start: 1921 },
      {
        name: "国共合作",
        start: 1924,
        info: "国共第一次合作、革命统一战线建立，国民大革命开始的标志：中国国民党一大召开",
      },
      { name: "北伐", start: 1926, end: 1928 },
      {
        name: "皖系段祺瑞下台",
        start: 1926.5,
        info: "皖系军阀段祺瑞、冯国璋、王士珍",
      },
      {
        name: "直系被灭",
        start: 1927,
        info: "直系军阀曹锟、吴佩孚、孙传芳, 被国民革命军消灭",
      },
      {
        name: "奉系垮台",
        start: 1928,
        info: "奉系张作霖,军阀政府垮台,历时十七年的北洋军阀从此覆灭",
      },
      {
        name: "九一八事变",
        start: 1931.9,
        info: "第一次中华苏维埃全国代表大会：在瑞金召开;中华苏维埃共和国临时中央政府成立",
      },
      { name: "伪满洲国成立", start: 1932 },
      { name: "红军长征", start: 1934, end: 1936 },
      {
        name: "遵义会议",
        start: 1935,
        info: "中国共产党从幼稚走向成熟的标志：遵义会议;一二·九运动",
      },
      { name: "西安事变", start: 1936 },
      { name: "抗日战争", start: 1931, end: 1945 },
      {
        name: "全面抗日",
        start: 1937,
        info: "日本发动全面侵华战争、抗日战争全面爆发的标志：七七事变;国民政府正面战场上的第一次大会战：淞沪会战;抗战开始第一次大捷：平型关大捷;南京大屠杀;重庆国民政府成立;第二次国共合作",
      },
      {
        name: "台儿庄战役",
        start: 1938,
        info: "国民正面战场抗战以来最大胜利：台儿庄战役;武汉会战",
      },
      { name: "第一次长沙会战", start: 1939 },
      { name: "百团大战", start: 1940, info: "南京汪伪国民政府成立;百团大战" },
      { name: "皖南事变", start: 1941, info: "围袭新四军事件; 第二次长沙会战" },
      { name: "第三次长沙会战", start: 1942 },
      { name: "豫湘桂战役", start: 1942 },
      {
        name: "日本投降",
        start: 1945,
        info: "中共七大;日本宣布投降;重庆谈判;“双十协定”签订",
      },
      { name: "国共内战", start: 1946, end: 1949 },
      {
        name: "三大战役",
        start: 1948,
        end: 1949,
        info: "辽沈战役、淮海战役、平津战役",
      },
      { name: "渡江战役", start: 1949, info: "国民党政权退往台湾" },
    ],
  },
  {
    name: "中华人民共和国",
    start: 1949,
    events: [
      {
        name: "韩战爆发",
        start: 1950,
        info: "志愿军入朝",
      },
      {
        name: "西藏解放",
        start: 1951,
        info: "",
      },
      {
        name: "完成土改",
        start: 1952,
        info: "",
      },
      {
        name: "韩战结束",
        start: 1953,
        info: "",
      },
      {
        name: "制定宪法",
        start: 1954,
        info: "",
      },
      {
        name: "农业合作化",
        start: 1955,
        info: "",
      },
      {
        name: "解放汽车",
        start: 1956,
        info: "",
      },
      {
        name: "武汉长江大桥",
        start: 1957,
        info: "",
      },
      {
        name: "三面红旗",
        start: 1958,
        info: "",
      },
      {
        name: "原子弹",
        start: 1964,
        info: "",
      },
      {
        name: "文革",
        start: 1966,
        info: "",
      },
      {
        name: "二月逆流",
        start: 1967,
        info: "",
      },
      {
        name: "人造卫星",
        start: 1970,
        info: "",
      },
      {
        name: "返联合国",
        start: 1971,
        info: "",
      },
      {
        name: "中日建交",
        start: 1972,
        info: "尼克松访华",
      },
      {
        name: "杂交水稻",
        start: 1973,
        info: "袁隆平",
      },
      {
        name: "核潜艇",
        start: 1974,
        info: "",
      },
      {
        name: "唐山地震",
        start: 1976,
        info: "唐山大地震",
      },
      {
        name: "吉大物理七九",
        start: 1979,
        info: "150位青年入学物理系，开始四年共同求学生活",
      },
      {
        name: "香港回归",
        start: 1997,
        info: "7月1日,香港回归祖国",
      },
      {
        name: "澳门回归",
        start: 1999,
        info: "12月20日,澳门回归祖国",
      },
      {
        name: "北京奥运",
        start: 2008,
        info: "8月8日,北京举办第二十九届奥运会,中国取得了金牌51枚、奖牌总数100枚的历史最好成绩",
      },
    ],
  },
  {
    name: "今年",
    start: 2022, // will be replaced runtime
  },
];

export default data;
